{
    "title": "investing",
    "num_less_than_three": 1,
    "0": {
        "date_range": [
            "2022-03-24",
            "2022-03-31"
        ],
        "posts": [
            {
                "title": "Warren Buffet has previously called EBITDA \"utter nonsense\". Can someone please ELI5 why he (and others) believe this?",
                "text": "I recently watched [this video](https://www.youtube.com/watch?v=tvnKylAyLbQ) where Warren Buffet calles EBITDA \"utter nonsense\", but I don't fully understand why he thinks this is the case.\n\nCan someone please ELI5 why some people take this view?\n\nWhat are the arguments and counterarguments for paying attention to EBITDA when it comes to valuing a company?",
                "date posted": "2022-03-27",
                "upvotes": 1080,
                "replies": {
                    "0": {
                        "upvotes": 1497,
                        "text": "The reasoning is that all the things that are being ignored (Interest, Taxes, Depreciation and Amortization) actually matter and can’t/shouldn’t be excluded from your metrics.\n\nImagine two companies that are exactly the same except that one holds lots of debt and so it pays out a significant portion of its gross earnings in interest. As an investor, those businesses look the *same* under EBITDA, but one is clearly not as good. Buffet  knows that companies always try and put their best foot forward, so the worse company will prominently lean on their “excellent” EBITDA when that is just obscuring a weakness with their business.\n\nSo why is EBITDA even a thing at all then? It can be useful to see discrepancies, like “this company would be much better *if not for this one aspect*” when maybe that aspect can be changed. A company doing a takeover might look at EBITDA and expect to neutralize the debt or restructure capital investments, or expect to leverage their international tax structures to reduce those burdens that weigh down the earnings of a company.\n\nBuffet is railing against using it as a *common* metric when it is only useful in specific niche situations. Especially when it is so appealing to general companies with poor business structures trying to disguise their biggest weaknesses."
                    },
                    "1": {
                        "upvotes": 58,
                        "text": "Former leveraged finance banker. EBITDA has its benefits in certain contexts. For example, Debt/EBITDA aka leverage is used to evaluate how much debt a company has relative to earnings, and to inform capital structure decisions (and for lenders, the basis for how much debt that company can support. For that metric to make sense/not be iterative, you have to look at the denominator before the impact of interest (and tax shield impact). EBITDA is also the basis for many valuation methodologies for the same reason, to determine how much overall capital a company can support (debt and equity) relative to earnings.\n\nBuffet’s stance is that interest, taxes and depreciation are important indicators of company decision making and industry dynamics. Which is true, you should look at a wide range of metrics (EBITDA, Net Income, Free Cash Flow, etc.) when evaluating companies to see the wholistic picture"
                    },
                    "2": {
                        "upvotes": 81,
                        "text": "Because I and T are all real expenses, and D and A are sometimes accounting fictions as well.  Fixed costs to keep your business functional (a simple example: keeping the bottling equipment running and replacing it when necessary at a bottling plant) are real costs.  They come out of your income.  Pretending you made more money by removing those costs is nonsense.\n\nI look at the cash flow statements first, and I'm pretty sure that's something Buffett and Munger do as well.  Those costs show up in cash flow."
                    },
                    "3": {
                        "upvotes": 12,
                        "text": "I work with a PE firm.  EBITDA is a really useful metric for comparing the operational value of different businesses. EBITDA margin is even more important for us than EBITDA alone. \nHaving said that we really care about cash flow, the balance sheet and the projected growth of the company.  EBITDA has its place but it is not everything."
                    },
                    "4": {
                        "upvotes": 148,
                        "text": "Management often focuses on EBITDA to make companies look more favorable than reality to investors. This helps them attract more investors, keep their jobs, pump up the price, and cash out incentives. \n\nIt reminds me of car dealerships that want their customers to focus on monthly payments rather than the cost of the car and the interest rate."
                    },
                    "5": {
                        "upvotes": 66,
                        "text": "Thing is, EBITDA has an use, can be used to separate the productive performance of the company from any financial issues.\n\nWhich is useful to see if your problem is operational or in your funding, but mostly useless as an outside investor.\n\nFor valuation, saying \"this stock would be good if they didn't have to pay back their liabilities and dont need to eventually replace worn down equipment\" is pretty nonsensical."
                    }
                }
            }
        ]
    },
    "1": {
        "date_range": [
            "2022-03-31",
            "2022-04-07"
        ],
        "posts": [
            {
                "title": "Twitter is up 26% pre-market as Elon Musk reveals a 9.2% stake in the company (now the largest shareholder of Twitter)",
                "text": "Per Bloomberg data, Musk’s 9.2 per cent Twitter stake would make him the largest shareholder in the company. Notably it’s more than quadruple the 2.25 per cent position of founder Jack Dorsey. At pixel time, Twitter’s stock is up 25 per cent in pre-market trading to $49.09. \n\n[https://www.ft.com/content/29b9c884-02d7-4d1c-a4ab-c862242fa76e](https://www.ft.com/content/29b9c884-02d7-4d1c-a4ab-c862242fa76e)",
                "date posted": "2022-04-04",
                "upvotes": 1988,
                "replies": {
                    "0": {
                        "upvotes": 1166,
                        "text": "Looks like he gonna suspend the aircraft tracking boy"
                    },
                    "1": {
                        "upvotes": 804,
                        "text": "And musk be like: \"Haha i just buy stocks, post what i buy and it jumps by 25% - good time to sell!\"\n\n(Just fanfiction, i can't read his mind!)"
                    },
                    "2": {
                        "upvotes": 97,
                        "text": "What a place to be, where your stock-buys auto-jump 25% instantly!  Talk about magic money printing machine 😅"
                    },
                    "3": {
                        "upvotes": 571,
                        "text": "IIRC Twitter has straight voting for a 3 year staggered board, so unless there is a concerted effort to stop him, Musk should be able to capture at the very least one seat on the board at the next election. His fanboys who are already buying stock will vote with him. He could end up picking the next CEO within 3 years. This is like an 80s style hostile takeover, how did management not see this coming?"
                    },
                    "4": {
                        "upvotes": 38,
                        "text": "Someone is not getting banned from Twitter."
                    },
                    "5": {
                        "upvotes": 310,
                        "text": "Ah, I see Elon Musk single handedly founded Twitter. Nice job, Elon!"
                    }
                }
            }
        ]
    },
    "2": {
        "date_range": [
            "2022-04-07",
            "2022-04-14"
        ],
        "posts": [
            {
                "title": "S&P becomes first ratings agency to declare Russian foreign currency debt in default",
                "text": "After Russia attempted to make payments on dollar denominated debt in Rubles, S&P Global changed Russia's foreign debt credit rating to the default classification. Russia tried to make the payment on April 4th, but it was blocked under US Sanctions. The Treasury Department had recently granted a waiver in March on such payments, but it's recent denial show an expanded effort to cut Russia off from global borrowing markets. \n\nRussia is in a classification of \"selective default\", in which it only failed to make payments on it's foreign currency debt. It still has a 30 day grace period from the missed payment on April 4th to make investors whole, but S&P believes further sanctions are coming and Russia will not have the ability to honor it's obligations. It's local currency debt is still rated in the category just above \"default\". \n\nInterestingly, S&P stated last month that it would halt ratings on Russian debt. They will no longer issue ratings on Russian debt after April 15th. They had to throw the default grenade into the mix just before they left the room.",
                "date posted": "2022-04-09",
                "upvotes": 2066,
                "replies": {
                    "0": {
                        "upvotes": 1,
                        "text": "This post has been locked due to excessive non-investment related comments."
                    },
                    "1": {
                        "upvotes": 185,
                        "text": "[removed]"
                    },
                    "2": {
                        "upvotes": 177,
                        "text": "S&P worked with banks back during the GFC to manipulate ratings of securities right? Is that the same S&P we’re talking about?"
                    },
                    "3": {
                        "upvotes": -596,
                        "text": "Russia wants to pay its debts to western companies, but western governments don't want them to.\n\nIts the reverse of the normal situation. Will be interesting to see how markets react."
                    },
                    "4": {
                        "upvotes": -202,
                        "text": "[removed]"
                    }
                }
            },
            {
                "title": "Elon Musk offers to buy Twitter for $41.39 billion",
                "text": "After taking a 9.2% stake in twitter, Elon musk has now offered to buy the entire company for $41.39 billion. This comes after some recent news announcement of Elon Musk not accepting the board seat position at Twitter because of some alleged background check. \n\nAccording to Twitter CEO, Parag Agarwal, Twitter and Elon couldn’t come to an agreement regarding the board. Parag notified his employees that there could soon be noise around the company. Twitter shares closed at a market cap of around $36.7 billion as of Wednesday. Shares are up 11% pre market as of this writing.",
                "date posted": "2022-04-14",
                "upvotes": 2025,
                "replies": {
                    "0": {
                        "upvotes": 1,
                        "text": "OP: you must include a source. We've been over this.\n\nSource tweet and SEC link:\n\nhttps://twitter.com/elonmusk/status/1514564966564651008?t=PuxHAiP3CQgidZ5VOQECtA&s=19\n\nE: this thread may end up being locked. There is a massive amount of political commenting going on that has nothing to do with Twitter or investing, so please try to stay on topic.\n\nE2: alright I can't keep up anymore with the hateful / political comments so it's lock o'clock. Sorry y'all, only takes a few to ruin the party."
                    },
                    "1": {
                        "upvotes": 1811,
                        "text": "Sucker i got twitter for free"
                    },
                    "2": {
                        "upvotes": 733,
                        "text": "\"I liked it so much, I bought the company.\""
                    },
                    "3": {
                        "upvotes": 1106,
                        "text": "Step 1: load up on Twitter stock at the lowest price point  \nStep 2: offer to buy the rest at an inflated price point  \nStep 3: cash out after the price skyrockets"
                    },
                    "4": {
                        "upvotes": 367,
                        "text": "Funding secured"
                    },
                    "5": {
                        "upvotes": 48,
                        "text": "Twitter on a roller coaster recently..."
                    }
                }
            },
            {
                "title": "Nine Years Ago, someone here asked what stock to hold for 20 years. Whats your pick for the next 9 years?",
                "text": "https://www.reddit.com/r/investing/comments/1bbbgh/if_you_were_to_buy_a_stock_today_to_hold_for_20/\n\nI saved this thread and looked back to see winners and losers. Some interesting picks here, GOOG, AAPL, along with some \"safer\" picks. Towards the bottom a few folks suggest TSLA, and at the very bottom, back in 2013, with -3 votes, someone suggests buying Bitcoin!\n\nSo... which stocks are you holding for 9, 10 years?",
                "date posted": "2022-04-12",
                "upvotes": 1810,
                "replies": {
                    "0": {
                        "upvotes": 707,
                        "text": "It's always fun revisiting old posts like that, it goes to show how things change and how bad people are at predicting the future, tons of people were recommending GE, being offended that people said IBM would stagnate, and there was even posts about how Google Glass was a surefire hit."
                    },
                    "1": {
                        "upvotes": 864,
                        "text": "That one guy who said TSLA..."
                    },
                    "2": {
                        "upvotes": 504,
                        "text": "Lol at the guy who said google was gonna have explosive growth because of google glass. He was right but sure as hell not cause of his reasoning hahaha"
                    },
                    "3": {
                        "upvotes": 84,
                        "text": "RemindMe! 9 years"
                    },
                    "4": {
                        "upvotes": 69,
                        "text": "Realistically, your top performers will be small or microcaps that hit it big. I don’t think I can pick them, so I’m just going to buy the likes of Intel and Agco and deal with what I think is a little better than average."
                    },
                    "5": {
                        "upvotes": 168,
                        "text": "I'm going to buy the stocks that were downvoted the most in this thread. They seem to be the winners last time."
                    }
                }
            },
            {
                "title": "Twitter board adopts ‘poison pill’ after Musk’s $43 billion bid to buy company",
                "text": "**Note:** The term poison pill refers to a defense strategy used by a target firm to prevent or discourage a potential hostile takeover by an acquiring company. Potential targets use this tactic in order to make them look less attractive to the potential acquirer: https://www.investopedia.com/terms/p/poisonpill.asp\n\n**Article:**\n\nhttps://www.cnbc.com/2022/04/15/twitter-board-adopts-poison-pill-after-musks-43-billion-offer-to-buy-company.html\n\nTwitter adopted a limited duration shareholder rights plan, often called a “poison pill,” a day after billionaire Elon Musk offered to buy the company for $43 billion, the company announced Friday.\n\nThe board voted unanimously to adopt the plan.\n\nUnder the new structure, if any person or group acquires beneficial ownership of at least 15% of Twitter’s outstanding common stock without the board’s approval, other shareholders will be allowed to purchase additional shares at a discount.\n\nThe plan is set to expire on April 14, 2023.\n\nSuch a move is a common way to fend off a potential hostile takeover by diluting the stake of the entity eying the takeover.\n\n“The Rights Plan will reduce the likelihood that any entity, person or group gains control of Twitter through open market accumulation without paying all shareholders an appropriate control premium or without providing the Board sufficient time to make informed judgments and take actions that are in the best interests of shareholders,” the company said in a press release.\n\nTwitter noted that the rights plan would not prevent the board from accepting an acquisition offer if the board deems it in the best interests of the company and its shareholders.\n\nMusk already owns a more than 9% stake in Twitter as revealed in a Securities and Exchange Commission filing last week. Soon after his stake became public, Twitter’s CEO announced plans for Musk to join the board. But days later, Musk reversed course and decided not to join the board after all.\n\nIf he had joined, Musk would not be allowed to accumulate more than 14.9% of beneficial ownership of the company’s outstanding common stock.\n\nAlso on Friday, Bloomberg reported, citing anonymous sources, that Twitter brought on JPMorgan to help respond to Musk’s bid. Twitter had already been working with Goldman Sachs and Musk has been working with Morgan Stanley.\n\nSeveral outlets including The New York Post reported Twitter was also fielding interest from Thoma Bravo, though it’s still uncertain a bid will materialize, according to sources who spoke to Reuters.\n\nJPMorgan has history with Musk, suing Tesla over a matter related to his 2018 tweet claiming he had “funding secured” to take the company private. Tesla later countersued the bank.\n\nJPMorgan, Twitter and Thoma Bravo declined comment.\n\nIn a live-streamed interview at the TED2022 conference in Vancouver on Thursday, Musk laid out his vision for making Twitter’s algorithms more publicly accessible and limiting content moderation.\n\nHe also acknowledged he’s “not sure” if he’ll actually be able to buy Twitter, though he said he does have “sufficient assets” to fund the deal if accepted. Despite his fortune, Musk has much of his assets tied up in equity in his companies including Tesla, meaning he’d likely have to liquidate or borrow against his assets to come up with a large sum.\n\nBut Musk said “there is” a Plan B if his initial offer to buy the company and take it private, which he called his “best and final,” is rejected. He declined to provide further details in the TED interview.\n\nOn Friday, Twitter’s former CEO and current board member Jack Dorsey tweeted that “the real issue” is that “as a public company, twitter has always been ‘for sale.’”",
                "date posted": "2022-04-15",
                "upvotes": 1775,
                "replies": {
                    "0": {
                        "upvotes": 925,
                        "text": "Twitter working with Goldman Sachs to fight off his offer for a takeover at $54?\n\nGS currently has a sell advisory on Twitter with a target price of $30. How can they possibly be advising theTwitter Board to do anything but grab the offer with both hands?"
                    },
                    "1": {
                        "upvotes": 162,
                        "text": "Not sure if this is really feasible (i.e. is there enough liquidity in the market), but could Musk load up on calls and execute them all at the same time? Thereby giving the current shareholders very little time to respond with a difficult and expensive decision to buy more shares."
                    },
                    "2": {
                        "upvotes": 171,
                        "text": "Wasn't this already posted under https://www.reddit.com/r/investing/comments/u4dpff/twitter_adopts_poison_pill_to_ward_off_musk/? Why was that post removed and then reposted here?\n\nI'm genuinely asking; I was the OP of the linked post and I'm not sure if I messed up with something."
                    },
                    "3": {
                        "upvotes": 638,
                        "text": "Seems like this is what Musk wanted. Now he can sell his shares for a healthy premium and be on his way,and blame the “deal” going sour on the board"
                    },
                    "4": {
                        "upvotes": 45,
                        "text": "What happens to leap options in poison pill scenario?"
                    },
                    "5": {
                        "upvotes": 222,
                        "text": "Sell your twitter stock. Garbage investment."
                    }
                }
            },
            {
                "title": "Elon Musk decides not to join Twitter board, says CEO Parag Agrawal",
                "text": "“Elon has decided not to join our board. I sent a brief note to the company, sharing with you all here.” - Parag Agrawal\n\nhttps://twitter.com/paraga/status/1513354622466867201?s=20&t=ljgxw1kVvOZi3M-FDeQi3g\n\nhttps://www.cnbc.com/2022/04/11/elon-musk-decides-not-to-join-twitter-board-says-ceo-parag-agrawal.html",
                "date posted": "2022-04-11",
                "upvotes": 1395,
                "replies": {
                    "0": {
                        "upvotes": 1058,
                        "text": "What a weird fuckin statement.\n\n\"We also believed that having Elon as a fiduciary of the company where he, like all board members, has to act in the best interests of the company and all our shareholders, was the best path forward.\"\n\n\"Elon shared that same morning that he will no longer be joining the board. I believe this is for the best.\"\n\nSo it's both the best that he's on the board, and also the best that he's not on the board!\n\nEdit: “Clear about the risks” “fiduciary” “subject to a background check” is very interesting wording in this announcement.  Read between the lines, folks"
                    },
                    "1": {
                        "upvotes": 820,
                        "text": "[deleted]"
                    },
                    "2": {
                        "upvotes": 137,
                        "text": "Welp looks like he has bought more lol"
                    },
                    "3": {
                        "upvotes": 213,
                        "text": "Board members capped at 14.9% ownership?  \nHostile takeover?"
                    },
                    "4": {
                        "upvotes": 198,
                        "text": "Can't believe he made a decision like this without polling his followers!"
                    },
                    "5": {
                        "upvotes": 259,
                        "text": "[deleted]"
                    }
                }
            }
        ]
    },
    "3": {
        "date_range": [
            "2022-04-14",
            "2022-04-21"
        ],
        "posts": [
            {
                "title": "Tesla's Q1 results; 3.3B net income, 19% operating margin, 33% auto gross margin. Reduced debt from 1.4B to 88 MILLION.",
                "text": "[Link to the Q1 financials.](https://tesla-cdn.thron.com/static/IOSHZZ_TSLA_Q1_2022_Update_G9MOZE.pdf?xseo=&response-content-disposition=inline%3Bfilename%3D%22TSLA-Q1-2022-Update.pdf%22)\n\nP/E is now ~130 and EPS for Q1 was 2.86. Forward P/E is ~90.\n\nTesla is an absolute financial monster and by retiring the debt they are saving ~200 million in headwinds due to interest payment. They sit on 17.5B cash while earning 3B+ in net income per quarter. Operating margin went from 14.6% in Q4 21 which was fantastic already, to 19.2% Q1 22...\n\nEDIT; Customary edit, thanks for all the gold. :)",
                "date posted": "2022-04-20",
                "upvotes": 2657,
                "replies": {
                    "0": {
                        "upvotes": 821,
                        "text": "That graph showing the effect that (non-Tesla) EV Super Bowl commercials had on Tesla's sales is incredible."
                    },
                    "1": {
                        "upvotes": 704,
                        "text": "This is unbelievable good! No other carmaker has such margin right?"
                    },
                    "2": {
                        "upvotes": 16,
                        "text": "Nice.\n\ni think they should further dowsize the debt further to 69.420M."
                    },
                    "3": {
                        "upvotes": 446,
                        "text": "Wow, a record quarter with revenue up 81% year-over-year.\n\nRevenue: $18.8 billion versus $17.9 billion expected\n\nAdjusted earnings per share: $3.22 versus $2.27 expected.\n\nTesla is really making it hard for its critics…"
                    },
                    "4": {
                        "upvotes": 141,
                        "text": "Why would they not take some of that 17.5B cash and pay off the remaining 88MM in debt?"
                    },
                    "5": {
                        "upvotes": 209,
                        "text": "[deleted]"
                    }
                }
            },
            {
                "title": "Fannie Mae forecasts U.S. economy to fall into modest recession next year",
                "text": "\"Our updated forecast includes an expectation of a modest recession in the latter half of 2023 as we see a contraction in economic activity as the most likely path to meet the Federal Reserve’s inflation objective given the current rate of wage growth and inflation.\" \n\nhttps://www.fanniemae.com/research-and-insights/forecast/inflation-rate-signals-tighter-monetary-policy-and-threatens-soft-landing",
                "date posted": "2022-04-19",
                "upvotes": 1389,
                "replies": {
                    "0": {
                        "upvotes": 944,
                        "text": "A mild recession is better than this inflation spiraling out of control."
                    },
                    "1": {
                        "upvotes": 57,
                        "text": "I feel like there is going to be so much recession talk by the time we get one the stock market will actually go up since it will have dropped so much beforehand."
                    },
                    "2": {
                        "upvotes": 282,
                        "text": "Where in gods name am I supposed to put money other than I-bonds and Real Estate?"
                    },
                    "3": {
                        "upvotes": 674,
                        "text": "I feel like this whole thing is held together with scotch tape and popsicle sticks"
                    },
                    "4": {
                        "upvotes": 179,
                        "text": "These analysts don't know anything!  I've been daytrading for .... \\*checks calendar\\* ... six months!\n\n^(/s)"
                    },
                    "5": {
                        "upvotes": 114,
                        "text": "Thanks you JPow for postponing the recession. Now I need to find a buyer for my boredape.gif"
                    }
                }
            },
            {
                "title": "new US Gov I-bond interest rates for April 2022 - 9.62%",
                "text": "don't know if this was already noted somewhere but this is a nice inflation hedge: looks like US Gov I-Bond interest rates will jump from a healthy 7.12% to a very nice 9.62% this month, for at least the next 6 months. https://keilfp.com/blogpodcast/i-bond-rate-november-2021-to-april-2022/",
                "date posted": "2022-04-18",
                "upvotes": 1117,
                "replies": {
                    "0": {
                        "upvotes": 300,
                        "text": "Is there an “I-bond buying for dummies” faq out there that is good?  Is it 10k per spouse?"
                    },
                    "1": {
                        "upvotes": 326,
                        "text": "That is great, and I own two $10k ones, but you can't invest enough to completely counter inflation so this is just a small tool to use to flight inflation."
                    },
                    "2": {
                        "upvotes": 28,
                        "text": "Just remember this will lock up the money for 1 year and if you cash them out before 5 years you lose the previous 3 months of interest."
                    },
                    "3": {
                        "upvotes": 451,
                        "text": ">a very nice 9.62%\n\npersonally i don't think it's nice, i think it's pretty scary."
                    },
                    "4": {
                        "upvotes": 14,
                        "text": "Glad I bought 10k today!!"
                    },
                    "5": {
                        "upvotes": 34,
                        "text": "Would it be dumb to use I bonds as an emergency fund? I know it has to sit for a year but I could slowly add money?  Beats my 1% account anyways lol"
                    }
                }
            },
            {
                "title": "Dow Tumbles Nearly 1,000 Points as Stocks Extend Selloff",
                "text": "https://www.wsj.com/articles/global-stocks-markets-dow-update-04-22-2022-11650613003?mod=hp_lead_pos1\n\nWorries about slowing corporate earnings and the Federal Reserve’s plans to rapidly raise interest rates dragged the Dow industrials to their worst day since 2020.\n\nInvestors this week parsed first-quarter financial results from a range of firms in search of clues about the health of the economy, the consumer outlook and companies’ ability to cope with inflation. Of the companies that have reported so far, about 80% have beat analyst expectations, according to FactSet, which has helped provide some stability to the U.S. stock market.\n\n“Usually when the economy’s slowing down, or there is a perception it’ll slow down, there are obvious sectors to hide in. Those traditional sectors aren’t as safe from an earnings basis as they are historically because they still are going to have negative impacts from inflation,” said Tavis McCourt, institutional equity strategist at Raymond James.\n\nThe Dow Jones Industrial Average posted its worst one-day percentage change since October 2020, losing 981.36 points, or 2.8%, to close at 33811.40. The S&P 500 dropped 121.88 points, or 2.8%, to 4271.78, while the Nasdaq Composite fell 335.36 points, or 2.5%, to finish at 12839.29. \n\nThe recent rise in government-bond yields showed signs of steadying, with the yield on the 10-year Treasury note ending Friday at 2.905%, down two of the past three trading days. Yields staged a climb earlier Friday before reversing course. Bond yields rise when prices decline.\n\nHealthcare stocks are often considered defensive, with money managers betting that consumers will pay medical bills before making discretionary purchases. The S&P 500’s healthcare sector fell 3.6%, its worst day since June 2020.\n\nConcerns about inflation and the pace of monetary tightening by the Fed also remained at the forefront of investors’ minds this week. On Thursday, Fed Chairman Jerome Powell gave investors a clear signal that the central bank is ready to tighten monetary policy more quickly and indicated that it was likely to raise interest rates by a half-percentage point at its meeting in May.\n\nA rate increase next month, following the Fed’s quarter percentage point increase in March, would mark the first time since 2006 that the central bank increased its policy rate at back-to-back meetings.\n\nMr. Powell’s comments injected fresh volatility into a stock market that has been whipsawed this year by the war in Ukraine, soaring inflation and rising Covid-19 cases in China.\n\n“The market is finally internalizing and factoring in the reality that the Fed really means what it says and it’s not going to back down,” said Tim Courtney, chief investment officer of Exencial Wealth Advisors. “Somebody had a saying, and it’s pretty\n good: ‘You don’t fight the Fed when the Fed is fighting inflation.’”\n\nIn commodities, Brent crude, the international benchmark for oil, fell $1.68 a barrel, or 1.6%, to $106.65. It fell 4.5% this week.\n\n---\n\nJust want to add, there's been some negative correlation between oil and the rest of the market, but today everything was bloody red.",
                "date posted": "2022-04-23",
                "upvotes": 1014,
                "replies": {
                    "0": {
                        "upvotes": 378,
                        "text": "Dust off the ole dow 30,000 hat..."
                    },
                    "1": {
                        "upvotes": 708,
                        "text": "I don't understand why everyone talks about points with the Dow (or the Dow at all for that matter). It seems like it would make much more sense to discuss percentage changes. I guess saying \"down nearly 1,000 points\" makes for a more lucrative headline than \"down 2.82%.\""
                    },
                    "2": {
                        "upvotes": 302,
                        "text": "Here’s a list of changes I’m making to my investment strategy because of this:"
                    },
                    "3": {
                        "upvotes": 73,
                        "text": "We really need to stop using “points” to report movement. Percentages."
                    },
                    "4": {
                        "upvotes": 67,
                        "text": "Fire sale."
                    },
                    "5": {
                        "upvotes": 52,
                        "text": "This is when everyone whose been holding cash loves to mention it. Lol. When VTI rips 25% they’ll be silent."
                    }
                }
            }
        ]
    },
    "4": {
        "date_range": [
            "2022-04-21",
            "2022-04-28"
        ],
        "posts": [
            {
                "title": "Robinhood Lays Off 9% Of Full-Time Employees After Decline In Users",
                "text": "[https://blog.robinhood.com/](https://blog.robinhood.com/)\n\n*Robinhood CEO Vlad Tenev shared the below to Robinhood employees following a company-wide meeting to discuss the changes.*\n\nToday we made the difficult announcement that we are letting go approximately 9% of our full-time employees. While this decision was necessary, it was not one we undertook lightly, and I’d like to share our rationale. \n\nAs you know, throughout 2020 and H1 2021, we went through a period of hyper growth accelerated by several factors including pandemic lockdowns, low interest rates, and fiscal stimulus. We grew net funded accounts from 5M to 22M and revenue from \\~$278M in 2019 to over $1.8B in 2021. To meet customer and market demands, we grew our headcount almost 6X from 700 to nearly 3800 in that time period.\n\nThis rapid headcount growth has led to some duplicate roles and job functions, and more layers and complexity than are optimal. After carefully considering all these factors, we determined that making these reductions to Robinhood’s staff is the right decision to improve efficiency, increase our velocity, and ensure that we are responsive to the changing needs of our customers.",
                "date posted": "2022-04-26",
                "upvotes": 3174,
                "replies": {
                    "0": {
                        "upvotes": 215,
                        "text": "Always sad to see people lose their jobs (been there, done that), but the truly infuriating part is usually reading management's statement on the matter. What's all this \"increase our velocity\" business? They're losing money (and now users, too). That's the reason, so just say it."
                    },
                    "1": {
                        "upvotes": 796,
                        "text": "I appreciate them getting the major brokerages to eliminate (or at least significantly reduce) commissions, but their refusal to work with compliance systems means that I had to drop my account when I became a covered person."
                    },
                    "2": {
                        "upvotes": 876,
                        "text": "It doesn't help they've been juking their active user stats to include anyone who opened the app or logged on to download prior year tax forms. 'Active' accounts are a joke. Turning off the buy button, cutting off same day deposits when 'certain' stocks seem to be taking off, and crypt o trading \"offline\" on spikes... you get what you deserve Robinhood!"
                    },
                    "3": {
                        "upvotes": 60,
                        "text": "I wish Fidelity would just copy or buy their interface design"
                    },
                    "4": {
                        "upvotes": 61,
                        "text": "“ you can’t fire me, I’m removing the fire button.”"
                    },
                    "5": {
                        "upvotes": 46,
                        "text": "Interesting that they chose not to mention any of the reasons that they may have lost users, or the negative moments the company has gone through.  There could have an opportunity for acknowledgement and a plan for the future.  This is doubtful to cause much empathy for the company from the public nor have anyone rushing to engage/reengage."
                    }
                }
            },
            {
                "title": "Twitter set to accept Musk's $43 bln offer - sources",
                "text": "From the article:\n\n> NEW YORK, April 25 (Reuters) - Twitter Inc (TWTR.N) is poised to agree a sale to Elon Musk for around $43 billion in cash, the price the chief executive of Tesla Inc (TSLA.O) has called his \"best and final\" offer for the social media company, people familiar with the matter said.\n\n> Twitter may announce the $54.20-per-share deal later on Monday once its board has met to recommend the transaction to Twitter shareholders, the sources said. It is always possible that the deal collapses at the last minute, the sources added.\n\nhttps://www.reuters.com/technology/exclusive-twitter-set-accept-musks-best-final-offer-sources-2022-04-25/\n\nThis was a fast turnaround from their \"poison pill\", if true.",
                "date posted": "2022-04-25",
                "upvotes": 1220,
                "replies": {
                    "0": {
                        "upvotes": 1,
                        "text": "Thread locked due to a high amount of political commentary / personal attacks."
                    },
                    "1": {
                        "upvotes": 635,
                        "text": "> This was a fast turnaround from their \"poison pill\", if true.\n\nI think this is a fundamental misunderstanding of what a poison pill is for.\n\nThe poison pill is the board of directors saying \"if you're gonna buy the company you have to go through us, come negotiate directly with us instead of trying to acquire a controlling stake on the open market.\""
                    },
                    "2": {
                        "upvotes": 280,
                        "text": "This might be a dumb question, but this means the company will now be private right?"
                    },
                    "3": {
                        "upvotes": 11,
                        "text": "Twitter management/shareholders should take the offer and run to the bank.  I don't see it going back to it's last year high anytime soon.  It's eerily similar to Yahoo in the 2000s when they rebuked Microsoft's 40B offer only to sell to Verizon for pennies a few years later.\n\nAs they say, a bird in the hand is worth two in the bush."
                    },
                    "4": {
                        "upvotes": 225,
                        "text": "[deleted]"
                    },
                    "5": {
                        "upvotes": 9,
                        "text": "25 for $45ea doesn’t sound so dumb now."
                    }
                }
            },
            {
                "title": "Elon Musk to Acquire Twitter",
                "text": "https://www.prnewswire.com/news-releases/elon-musk-to-acquire-twitter-301532245.html\n\n> Twitter, Inc. (NYSE: TWTR) today announced that it has entered into a definitive agreement to be acquired by an entity wholly owned by Elon Musk, for $54.20 per share in cash in a transaction valued at approximately $44 billion. Upon completion of the transaction, Twitter will become a privately held company.\n\n> Under the terms of the agreement, Twitter stockholders will receive $54.20 in cash for each share of Twitter common stock that they own upon closing of the proposed transaction. The purchase price represents a 38% premium to Twitter's closing stock price on April 1, 2022, which was the last trading day before Mr. Musk disclosed his approximately 9% stake in Twitter.\n\nThe stock currently trades at $51.",
                "date posted": "2022-04-25",
                "upvotes": 1168,
                "replies": {
                    "0": {
                        "upvotes": 1,
                        "text": "Thread locked due to a high amount of political commentary / personal attacks."
                    },
                    "1": {
                        "upvotes": 128,
                        "text": "His master plan is to Elongate the tweet character limit"
                    },
                    "2": {
                        "upvotes": 375,
                        "text": "It's 4% premium from its current price.\n\nFor a peasant such as myself, I guess there's no point holding on to the shares."
                    },
                    "3": {
                        "upvotes": 31,
                        "text": "[removed]"
                    },
                    "4": {
                        "upvotes": 24,
                        "text": "What’s the timeline for this to officially go through? I haven’t seen any dates."
                    },
                    "5": {
                        "upvotes": 126,
                        "text": "So does this mean the company goes private under Musk?  Sorry if I am ignorant on how these things work"
                    }
                }
            }
        ]
    },
    "5": {
        "date_range": [
            "2022-04-28",
            "2022-05-05"
        ],
        "posts": [
            {
                "title": "The stock market is a total joke…",
                "text": "Up 3% yesterday, down 3% this morning. How does any of this make any sense anymore? \n\nCan anyone explain these wide market swings? At this point, they’re starting to seem arbitrary to me. But, then again, I’m just a passive trader trying to scrape together enough to maybe retire one day. What do I know?\n\nEdit: I should clarify that I’ve been casually invested since 2009 and do have a bit of knowledge about the market’s historical volatility. My post is mostly just venting. \n\nBut, what’s really been confusing me are the extremes of the market’s swings this year, as compared to others. It is not normal or typical market behavior to have a record increase one day immediately followed by a record decrease the next day. The current labor climate and supply chain issues have been ongoing for more than a year, so that shouldn’t be new news to investors. \n\nAs a long term investor, I’ll continue to buy and weather the storm. But, again, my point is that, as I understand it, the volatility over the past year is historically anomalous and I was curious if anyone could put it into perspective for me.",
                "date posted": "2022-05-05",
                "upvotes": 1542,
                "replies": {
                    "0": {
                        "upvotes": 2333,
                        "text": "\\- Can anyone explain these wide market swings?\n\n\\+ *It is estimated that 50 percent of stock trading volume in the U.S. is currently being driven by computer-backed high frequency trading -* Source: [Nasdaq](https://www.nasdaq.com/glossary/h/high-frequency-trading)"
                    },
                    "1": {
                        "upvotes": 507,
                        "text": "[removed]"
                    },
                    "2": {
                        "upvotes": 558,
                        "text": "Buy companies, be a passive owner, the day to day fluctuations are irrelevant."
                    },
                    "3": {
                        "upvotes": 201,
                        "text": "Being old enough, unfortunately, or fortunately, do have ridden this pony multiple times before. You get used to it. \n\nI'm only 3 years away from retiring and not panicking . I'm down considerably but, it's life.  My fiance' is battling cancer and all my money will mean nothing to me if she loses that fight.\n\nEven at my age, it's not like I'll need all that money the day I retire. The way I look at it, hopefully, I'll have another 20 years left to ride the market waves."
                    },
                    "4": {
                        "upvotes": 1577,
                        "text": "> At this point, they’re starting to seem arbitrary\n\nCongratulations, you won the stock market. Pundits always try to add meaning to random movements and create a nerative, while in reality the vast majority of stock market movements are completely random"
                    },
                    "5": {
                        "upvotes": 79,
                        "text": "I'll continue to buy stocks \"on sale\" that I won't need to sell until 2050."
                    }
                }
            },
            {
                "title": "The Fed is about to make history again today",
                "text": "The US Federal Reserve is expected to raise its benchmark policy rate by half a percentage point for the first time since 2000 and formalise plans to shrink its $9tn balance sheet, as it embraces a more aggressive approach to tackling elevated inflation.  What will be the consequences of this choice in your opinion?",
                "date posted": "2022-05-04",
                "upvotes": 1523,
                "replies": {
                    "0": {
                        "upvotes": 1700,
                        "text": "This is long over due. The Fed should’ve ripped off the band-aid a while ago."
                    },
                    "1": {
                        "upvotes": 239,
                        "text": "[removed]"
                    },
                    "2": {
                        "upvotes": 577,
                        "text": "This is long overdue. Cheap money only leads to bubbles and widens the wealth gap. Sky-high housing prices and  living expenses are tearing societies apart."
                    },
                    "3": {
                        "upvotes": 237,
                        "text": "[deleted]"
                    },
                    "4": {
                        "upvotes": 340,
                        "text": "I’m still waiting on the rate of my HYSA to budge at all. You’d think with these rate hikes we’d see savings interest rates rise to encourage saving instead of spending."
                    },
                    "5": {
                        "upvotes": 17,
                        "text": "Everything we do is ‘creating history’ next moment. Realistically this is more about repeating history than creating history."
                    }
                }
            },
            {
                "title": "Warren Buffett Says Markets Have Become a ‘Gambling Parlor’",
                "text": "https://www.wsj.com/articles/warren-buffett-says-markets-have-become-a-gambling-parlor-11651340230?mod=hp_lead_pos2\n\n“It’s a gambling parlor,” Mr. Buffett said Saturday of the markets over the past few years. He added that he blamed the financial industry for motivating risky behavior among investors. While he finds speculative bets “obscene,” the pickup in volatility across the markets has had one good effect, he said: It has allowed Berkshire to find undervalued businesses to invest in again following a period of relative quiet. \n\nUp until recently, Berkshire had largely been sitting on its cash pile. Its business thrived; a recovering economy and roaring stock market helped push net earnings to a record in 2021. But it didn’t announce any major deals, something that led many analysts and investors to wonder about its next moves. Berkshire ended the year with a near record amount of cash on hand. (After Berkshire’s buying spree, the size of the company’s war chest shrank to $106.26 billion at the end of the first quarter, from $146.72 billion three months earlier.)\n\nMr. Buffett’s feeling that there were no appealing investment opportunities for Berkshire quickly gave way to excitement in late February, he said Saturday, when he got a copy of Alleghany Chief Executive Joseph Brandon’s annual report.\n\nBerkshire’s decision to build up a 14% stake in Occidental also came about with a report. Mr. Buffett said he had read an analyst note on the company, whose stock is still trading below its 2011 high, and decided the casino-like market conditions made it a good time to buy the stock.\n\n“I don’t think we ever had anything quite like we have now in terms of the volumes of pure gambling activity going on daily,” Mr. Munger said. “It’s not pretty.” \n\nBut the amount of speculation in the markets has given Berkshire a chance to spot undervalued businesses, Mr. Munger said, allowing the company to put its $106 billion cash reserve to work.\n\nNeither Mr. Buffett nor Mr. Munger specifically addressed Berkshire’s decision to increase its Chevron stake.\n\nBut the two men offered a defense of the oil industry. It is a good thing for the U.S. to be producing more of its own oil, Mr. Buffett said. Mr. Munger went further, saying he could hardly think of a more useful industry. \n\n---\n\nPersonally I'm not sure what made OXY or CVX so much more appealing this year than last year or the year before, when they were selling for much less.",
                "date posted": "2022-05-01",
                "upvotes": 1439,
                "replies": {
                    "0": {
                        "upvotes": 829,
                        "text": "Agreed. I bet sports in Las Vegas for 24 years. The guys who had no clue what they were doing were the ones who thought they had to watch every game and make dozens of subjective decisions. Reading these investment forums is like being treated to that same mindset every day."
                    },
                    "1": {
                        "upvotes": 352,
                        "text": "I'm shocked to find that gambling is going on in this establishment!....your winnings sir.  Thank you, thank you very much!"
                    },
                    "2": {
                        "upvotes": 41,
                        "text": "Anyone know where I can find the full Berkshire Hathaway meeting recording?"
                    },
                    "3": {
                        "upvotes": 30,
                        "text": "What was it before ?"
                    },
                    "4": {
                        "upvotes": 31,
                        "text": "Ignore the headline. The real key point in the article is that Buffett is buying now."
                    },
                    "5": {
                        "upvotes": 24,
                        "text": "In the short run, the market is a gambling machine, but in the long run, it is a weighing machine."
                    }
                }
            },
            {
                "title": "Every ARKK Holding Is in the Red This Year Except for Its Cash",
                "text": "[https://www.bloomberg.com/news/articles/2022-05-06/every-arkk-holding-is-in-the-red-this-year-except-for-its-cash](https://www.bloomberg.com/news/articles/2022-05-06/every-arkk-holding-is-in-the-red-this-year-except-for-its-cash)\n\nRemember when they started an inverse ARKK ETF specifically to bet against Cathie Wood's picks?  Why is this fund still attracting any serious attention?",
                "date posted": "2022-05-06",
                "upvotes": 1288,
                "replies": {
                    "0": {
                        "upvotes": 1179,
                        "text": "Most stocks are in the red to be fair."
                    },
                    "1": {
                        "upvotes": 93,
                        "text": "Imagine if she wasn’t right about one of her stocks — Tesla"
                    },
                    "2": {
                        "upvotes": 335,
                        "text": "No, its ***cash*** NOW is worth -8.5% less in terms of purchasing power. Ha ha."
                    },
                    "3": {
                        "upvotes": 66,
                        "text": "ARK should start buying SARK, then they won't know what to do"
                    },
                    "4": {
                        "upvotes": 41,
                        "text": "Pain"
                    },
                    "5": {
                        "upvotes": 8,
                        "text": "Just makes me respect Peter Lynch founder/manager of the Fidelity Maggellan fund who returned close to 30% avg annual returns for something close to 25 years."
                    }
                }
            }
        ]
    },
    "6": {
        "date_range": [
            "2022-05-05",
            "2022-05-12"
        ],
        "posts": [
            {
                "title": "Nvidia fined $5.5 million by SEC for hiding how many gaming GPUs were sold to crypto miners",
                "text": "Link to article from [The Verge](https://www.theverge.com/2022/5/6/23059930/nvidia-sec-charges-fine-settlement-gaming-gpu-crypto-mining)\n\n\"Nvidia will pay $5.5 million to settle charges that it unlawfully obscured how many of its graphics cards were sold to cryptocurrency miners. The US Securities and Exchange Commission announced the charges and a settlement with the company today. Its order claims Nvidia misled investors by reporting a huge boost in revenue related to “gaming,” hiding how much its success relied on the far more volatile crypto market. Nvidia isn’t admitting to wrongdoing as part of the settlement, but it agrees to stop any unlawful failures to disclose information.\n\nThe charges stem from Nvidia’s fiscal year 2018 financial reports. The SEC notes Nvidia saw an explosion in crypto mining-related sales in 2017, when the rewards of mining Ethereum grew dramatically. Crypto mining was widely reported as a cause of GPU scarcity, and Nvidia launched a separate CMP line specifically for mining, attempting to prevent shortages for gamers. But employees apparently acknowledged that many gaming GPUs were still going to miners. “The company’s sales personnel, in particular in China, reported what they believed to be significant increases in demand for Gaming GPUs as a result of crypto mining,” the order says.\n\nGiven the boom-and-bust nature of cryptocurrency, this meant Nvidia’s sales numbers didn’t necessarily indicate reliable future growth, making investing in it riskier. “NVIDIA’s analysts and investors were interested in understanding the extent to which the company’s Gaming revenue was impacted by crypto mining and routinely asked senior management about the extent to which increases in gaming revenue during this time frame were driven by crypto mining,” the SEC alleges.\n\nDespite this, Nvidia didn’t mention mining-related sales as a factor in its gaming division’s success. Meanwhile, it mentioned crypto as an important factor in other markets, which suggested to the SEC that it was being deliberately deceptive. And investors’ anxieties turned out to be well-founded. A crypto crash in late 2018 (along with a weakening Chinese market) led it to slash its quarterly earnings projections by $500 million and spurred a shareholder lawsuit.\n\n“NVIDIA’s disclosure failures deprived investors of critical information to evaluate the company’s business in a key market,” says SEC Crypto Assets and Cyber Unit head Kristina Littman. “All issuers, including those that pursue opportunities involving emerging technology, must ensure that their disclosures are timely, complete, and accurate.”\"\n\n[Edit] lots of people asking why this is illegal.\n\nAccording to the investigation, Nvidia conducted internal research which indicated this was how the cards were being used. Instead of notifying shareholders about this, they claimed to be increasing their market share in the gaming sphere. Of course, this becomes problematic for investors when crypto goes into a bear market (like now), and investors are left holding bags wondering why everyone is buying second hand cards from miners all of a sudden.",
                "date posted": "2022-05-07",
                "upvotes": 2465,
                "replies": {
                    "0": {
                        "upvotes": 503,
                        "text": "I remember that story.  ‘Crypto did not materially impact our revenue’ or something."
                    },
                    "1": {
                        "upvotes": 250,
                        "text": "So, who do these multi-million dollar settlements pay out to? To the SEC?"
                    },
                    "2": {
                        "upvotes": 613,
                        "text": "$5.5m? Net profit in 2021 was $4.3b. That's .1% of profits for the year.\n\nSo, basically it barely even qualifies as a cost of doing business. That'll show em SEC. That'll show em."
                    },
                    "3": {
                        "upvotes": 124,
                        "text": "[deleted]"
                    },
                    "4": {
                        "upvotes": 81,
                        "text": "That’s such a drop in the bucket for NVDA, I doubt it affects their stock at all"
                    },
                    "5": {
                        "upvotes": 6,
                        "text": "Judge: “The defendants will now step forward for the ceremonial tapping of the wrist.”"
                    }
                }
            },
            {
                "title": "Musk puts on hold $44-billion deal for Twitter",
                "text": "Another twist in the Twitter acquisition soap opera. Posted since quite a few people had been interested in arb-ing the acquisition recently.\n\nhttps://www.reuters.com/technology/musk-says-44-billion-twitter-deal-hold-2022-05-13/\n\n>May 13 (Reuters) - Elon Musk on Friday put his $44-billion deal for Twitter Inc (TWTR.N) temporarily on hold, citing pending details in support of calculation that spam and fake accounts indeed represent less than 5% of users.\n\n>Shares of the social media company fell 17.7% to $37.10 in premarket trading, their lowest level since Musk disclosed his stake in the company in early April and subsequently made a \"best and final\" offer to take it private for $54.20 per share.\n\n>The implied probability of the deal closing at the agreed price fell below 50% for the first time on Tuesday, when Twitter shares dropped below $46.75. read more\n\n>Twitter had earlier this month estimated that false or spam accounts represented fewer than 5% of its monetizable daily active users during the first quarter, when it recorded 229 million users who were served advertising.\n\n>\"Twitter deal temporarily on hold pending details supporting calculation that spam/fake accounts do indeed represent less than 5% of users,\" Musk tweeted on Friday.\n\nMore:\n\nhttps://www.bloomberg.com/news/articles/2022-05-13/twitter-shares-slump-after-musk-says-takeover-on-hold\n\nhttps://www.wsj.com/articles/elon-musk-tweets-that-twitter-deal-is-temporarily-on-hold-11652436335?mod=hp_lead_pos1",
                "date posted": "2022-05-13",
                "upvotes": 1827,
                "replies": {
                    "0": {
                        "upvotes": 1038,
                        "text": "Shocked pikachu"
                    },
                    "1": {
                        "upvotes": 520,
                        "text": "Elon flip flops have created bag holders once again."
                    },
                    "2": {
                        "upvotes": 743,
                        "text": "Why doesn't he just start his own twitter and pay 44 million people $1000 to sign up"
                    },
                    "3": {
                        "upvotes": 142,
                        "text": "Matt Levine @ Bloomberg starts off his long comment on this with the following:\n\n\n“Temporarily on hold” is not a thing. Elon Musk has signed a binding contract requiring him to buy Twitter. Legions of bankers and lawyers and Twitter employees and special-purpose-vehicle promoters are working to fulfill his legal obligation to get the deal closed. “The parties hereto will use their respective reasonable best efforts to consummate and make effective the transactions contemplated by this Agreement,” says the merger agreement. (Section 6.3(a).) He can’t just put that “on hold.”\n\n\nThat contract does not allow Musk to walk away if it turns out that “spam/fake accounts” represent more than 5% of Twitter users. We discussed this last month, when Twitter admitted in a securities filing that it had (slightly) overestimated its daily active users for years. The merger agreement contains a provision that allows Musk to walk away if Twitter’s securities filings are wrong — and this 5% number is in its securities filings — but only if the inaccuracy would have a “Material Adverse Effect” on the company. (See Sections 4.6(a) and 7.2(b).) That is an incredibly high standard: Delaware courts have almost never found an MAE. An MAE has to be something that would “substantially threaten the overall earnings potential of the target in a durationally-significant manner,” the courts have said; there is a rule of thumb that an MAE requires a 40% decrease in long-term profitability. If it turned out that 6% or 20% or 50% of Twitter accounts are bots, that will be embarrassing and might even reduce Twitter’s future advertising revenue, but will it be an MAE? No.\n\n“Pending details supporting calculation” is not how this works. This disclosure — that “the average of false or spam accounts ... represented fewer than 5% of” Twitter’s monetizable daily active users — has been in Twitter’s securities filings for many years, always with a caveat that “in making this determination, we applied significant judgment, so our estimation of false or spam accounts may not accurately represent the actual number of such accounts, and the actual number of false or spam accounts could be higher than we have estimated.” Musk had the opportunity to read these filings before offering to buy Twitter, and he had the opportunity to do due diligence on these numbers before signing the deal. (He declined.) He can’t now go to Twitter and say “actually now you need to prove that your user numbers are right.” If he wants to walk, he has to prove that they’re wrong, and also that they’re wrong in a way that has a material adverse effect on the business. Which he obviously can’t do."
                    },
                    "4": {
                        "upvotes": 203,
                        "text": "The guy is literally trying to see how much he can stretch the boundaries of \"market manipulation\"."
                    },
                    "5": {
                        "upvotes": 403,
                        "text": "I'm sure it has nothing to do with crypto/TSLA imploding at all..."
                    }
                }
            },
            {
                "title": "Bitcoin tumbles more than 50% below its all-time high...and now?",
                "text": "At a price of just below $31,000, bitcoin is more than 50% below its record high of near $69,000 from late last year and at its lowest point since July 2021.  Cryptocurrencies are proving to be just as risky as stocks and susceptible to the same concerns that are dragging down the Dow, S&P 500 and Nasdaq. Are you still bullish on bitcoin for the long term or not?",
                "date posted": "2022-05-09",
                "upvotes": 1615,
                "replies": {
                    "0": {
                        "upvotes": 2277,
                        "text": "Everyone is well aware that cryptos are way riskier than stocks. This is the 8th time Bitcoin has crashed 50% or more in the last 10 years."
                    },
                    "1": {
                        "upvotes": 1255,
                        "text": "First time?"
                    },
                    "2": {
                        "upvotes": 607,
                        "text": "...\"just as risky as stocks\"?\n\nAre you high? Cryptos have always been FAR RISKIER than stocks. Stocks are at least nominally attached to some sort of value generation. Cryptos are literally just vapor. I say this as someone who is invested in crypto, so I'm not a hater, I just understand that they are quite risky by nature."
                    },
                    "3": {
                        "upvotes": 1476,
                        "text": "It's funny crypto people all claimed that it's unregulated and inflation proof. Now it's literally moving with the stock market in fear of inflation lol."
                    },
                    "4": {
                        "upvotes": 339,
                        "text": "It dropped 85% in 2018. No reason to think that's not possible now. Bullish long-term, bearish short term."
                    },
                    "5": {
                        "upvotes": 282,
                        "text": ">Cryptocurrencies are proving to be just as risky as stocks\n\nMore risky than stocks\\*\n\nBitcoin is down 37.1% YTD. The S&P 500 is down only 16.7%. That's almost 2x as risky..."
                    }
                }
            },
            {
                "title": "Ford Motor is selling 8 million of its Rivian Automotive shares. The automaker currently owns 102 million shares of Rivian. Ford will be selling the shares through Goldman Sachs",
                "text": " \n\nFord Motor is selling 8 million of its Rivian Automotive shares, with the insider lockup for the stock of the once high-flying electric vehicle maker is set to expire on Sunday, sources told CNBC’s David Faber.\n\nThe automaker currently owns 102 million shares of Rivian. Ford will be selling the shares through Goldman Sachs, sources said.\n\nThe lockup defines a period of time after a company has gone public when early investors and company insiders cannot sell their shares. That ensures the IPO is carried out in an orderly manner and does not flood the market with additional shares.\n\n \n\nJPMorgan Chase also plans to sell a Rivian share block of between 13 million and 15 million for an unknown seller, sources told Faber. Both blocks of stocks are priced at $26.90 a share.\n\nShares of the EV manufacturer have plummeted by more than 50% in the first three months of 2022, reversing course from the fourth quarter, when the company held its stock market debut and saw its value skyrocket.\n\n[Ford declined to comment, when contacted by CNBC.](https://www.cnbc.com/2022/05/08/ford-is-selling-8-million-rivian-shares-sources-say.html)",
                "date posted": "2022-05-08",
                "upvotes": 1564,
                "replies": {
                    "0": {
                        "upvotes": 122,
                        "text": "After Rivian's IPO in November they had a market cap larger than Ford's.  It's not surprising to see it fall so much recently.\n\nAlso makes sense for Ford to sell some of their shares and bring in cash now that they're making massive investments to increase their production capacity of EVs."
                    },
                    "1": {
                        "upvotes": 316,
                        "text": "RIVN has 883M shares outstanding. Just for context."
                    },
                    "2": {
                        "upvotes": 102,
                        "text": "And don’t forget $RIVN has ER this week which potentially (likely) will bring the price down."
                    },
                    "3": {
                        "upvotes": 458,
                        "text": "What is the probability of Amazon just outright acquiring Rivian, and then competing in the EV market? Apple is making an EV apparently, and Google has Waymo. Wouldn't be the craziest move by Amazon."
                    },
                    "4": {
                        "upvotes": 77,
                        "text": "Does it mean share fair value $26.9?"
                    },
                    "5": {
                        "upvotes": 32,
                        "text": "I’ve seen some driving around, actually really like them. I am in Indiana so relatively close to their production factoring in Illinois I believe?"
                    }
                }
            },
            {
                "title": "Anyone else find this downturn legitimately depressing?",
                "text": "I’ve lost $35K since November and am down like $25K lifetime due to dumping a lot into stocks after I got bonuses in December.  I just find it depressing that I could have never saved/invested and instead burned $35K on living a luxurious life for many months, and I’d be in the same financial position I am in today.  \n\nI know things should bounce back eventually, but I’ve now lost as much money as I’ve made in some years (a long time ago).  Just makes me sad; I feel like I’ve sacrificed a lot to earn and save what I have, and it feels worthless right now (because I’m literally worse off than my friends who just spent their money on luxuries and/or haven’t bothered to invest).\n\n**Edit:**  This post took off way more than I expected; it was really just meant to be an anonymous rant into the void on a bad day!  I am not suggesting that it would actually have been wiser to blow money on luxuries than to invest.  And I am fully aware of what it means for a loss to be unrealized.  But the following is mathematically true:  If I liquidated my portfolio in November, spent $35K on luxuries between that day and the day of my post, and then on the day of my post I bought back into the market with my remaining cash, I would have the exact same assets and net worth as I did in reality.  That is a fact.  And it's a fact that I found sad, because *with the benefit of hindsight, knowing exactly what the market would do*, it would in fact have been better to spend the $35K on luxuries.  But in reality, we never know exactly when the market will tank, so, in reality, it would not make sense to choose luxuries over investing.  Nothing in my post is meant to suggest investing is a bad idea; you can't time the market and you have to accept that the value of your assets will drop sometimes.",
                "date posted": "2022-05-09",
                "upvotes": 1432,
                "replies": {
                    "0": {
                        "upvotes": 2183,
                        "text": "Just dont sell \n\nThis isnt my first rodeo \n\nI've lived thru the 2007 - 2009 \n\n2019 - 2020 \n\nYou got this just dont sell it will rebound (edit - this is my personal experience I am not an expert I just like when line go up and sad when line go down)"
                    },
                    "1": {
                        "upvotes": 588,
                        "text": "Nothing goes straight up. Everyone knew eventually there would be some sort of correction. And now here we are. Follow whatever investing plan you put in place, and do what you can to keep your job."
                    },
                    "2": {
                        "upvotes": 910,
                        "text": "Paper losses.  Unless you’re nearing retirement age, this should be viewed as a great opportunity to accumulate."
                    },
                    "3": {
                        "upvotes": 36,
                        "text": "You aren’t technically in the same position. \n\nAssuming you’re invested in quality companies you believe in long term, you’ll see the compounding growth as you DCA and collect dividends. \n\nI know it’s hard not to compare yourself with others but there’s a balance to this. Don’t sacrifice the present while saving for the future. Find things that make you happy and adjust your budget accordingly. A budget helped me realize I was saving incredibly high amounts of my income and could afford to splurge a little. \n\nBest of luck and stay strong!"
                    },
                    "4": {
                        "upvotes": 420,
                        "text": "Down nearly 100k, absolutely do not give a shit. What I found much more depressing was my income losing purchasing power not just when it comes to daily necessities but also assets.  At least this fixes the latter and may be a little of the former."
                    },
                    "5": {
                        "upvotes": 158,
                        "text": "That's a shitty feeling.  Especially FOMO.  FOMO gets me also.\n\n\nI didn't get quite that good a bonus, but in 2007-2008 put around $50k into the market.  That was a scary time.  Luckily I had a good job.  Total market was down over 50%.  Bank stocks went to near zero.  That money I put in, that went down by 50% at one point, has tripled since then.\n\n\nThe market, short term, is cruel.  You can make the right choice and lose, or the wrong choice and win.  Long term though, it has rewarded good decisions."
                    }
                }
            }
        ]
    },
    "7": {
        "date_range": [
            "2022-05-12",
            "2022-05-19"
        ],
        "posts": [
            {
                "title": "U.S. existing home sales fall for third straight month; house prices at record high",
                "text": "[https://www.reuters.com/business/us-existing-home-sales-fall-third-straight-month-house-prices-record-high-2022-05-19/](https://www.reuters.com/business/us-existing-home-sales-fall-third-straight-month-house-prices-record-high-2022-05-19/)\n\n \n\nU.S. existing home sales dropped to the lowest level in nearly two years in April as house prices jumped to a record high amid a persistent lack of inventory.\n\nExisting home sales fell 2.4% to a seasonally adjusted annual rate of 5.61 million units last month, the lowest level since June 2020 when sales were rebounding from the COVID-19 lockdown slump. It was the third straight monthly sales decline.",
                "date posted": "2022-05-19",
                "upvotes": 2386,
                "replies": {
                    "0": {
                        "upvotes": 725,
                        "text": "Supply is still shit in my area LOL. Currently the only options that aren’t 400K-500K homes are 300K condos with $500+ HOAs or apartments for $1,600 rent for a single. \n\nDemands falling off for sure but availability just isn’t there either"
                    },
                    "1": {
                        "upvotes": 430,
                        "text": "According to Redfin, new listing are just about back to the pace they were running at this time in 2019, but sales are still a touch higher (and pending sales are still substantially higher). That said, active listings are still *half* of what they were in 2019, so we have a lot of catching up to do if we're going to get back to a \"normal\" market.\n\nFWIW, while median sale prices are still up 16% YoY, price drops have doubled since the beginning of the year and are increasing fast, so there is definitely some level of downward pressure.\n\nI'd be curious to know how much the data has been skewed by new construction being completely sold out over the past two years. Anecdotally, builders have been selling houses they didn't intend to have completed for 12+ months, so that's a lot of forward inventory that was wiped off the market, and starting new neighborhoods (thereby rebuilding inventory) takes time."
                    },
                    "2": {
                        "upvotes": 92,
                        "text": "We live in new construction area (my area is already built) and the demand is insane.  House down the street went up for sale and they had something like 30 offers the first weekend.  Supply can't keep up."
                    },
                    "3": {
                        "upvotes": 124,
                        "text": "I keep getting mail from realtors offering to sell my house with a values about 100k more than I paid.\n\nIt'd inciting, but then I'd have 100k and no home."
                    },
                    "4": {
                        "upvotes": 13,
                        "text": "I hate the idea of rooting for a crash knowing the collateral damage it can cause, but I'm rooting for a crash anyways because I would like to be able to afford a house at some point in my lifetime."
                    },
                    "5": {
                        "upvotes": 12,
                        "text": "If we were to have a 40%+ stock market crash, housing would be one of the last shoes to drop. \n\nThe reason prices could drop would be people losing jobs, income streams, and wealth in their portfolios. These people may suddenly find themselves house poor if they already own or withdraw indefinitely from the market if they're looking to buy.\n\nRetirees or people who have significant portions of their wealth in housing (boomers) will see their retirement portfolios crashing and may panic sell their houses to make things work on the other end. If everyone is suddenly 40% poorer, the number of buyers will be drying up at the same time. This would cause prices to fall.\n\nThis is obviously hypothetical and we're not there...yet. But the people in this thread saying that housing is not in a bubble or that prices will not crash are being a bit too deterministic. The wider market could definitely have a huge impact on housing prices, particularly if we start seeing more defaults and layoffs."
                    }
                }
            },
            {
                "title": "Target shares sink 25% after company says high costs, inventory woes hit profits",
                "text": "https://www.cnbc.com/2022/05/18/target-tgt-q1-2022-earnings.html\n\nEarnings were $2.19 adjusted vs. $3.07 expected. Blame was placed on the usual suspects - \"supply chain troubles, higher fuel costs and lower than expected sales of discretionary merchandise.\"",
                "date posted": "2022-05-18",
                "upvotes": 2228,
                "replies": {
                    "0": {
                        "upvotes": 212,
                        "text": "All retail is crashing. Target, Walmart Costco ect."
                    },
                    "1": {
                        "upvotes": 437,
                        "text": "Brutal times for the retailers (well, everyone). Walmart and Amazon well off as of late too"
                    },
                    "2": {
                        "upvotes": 1066,
                        "text": "A year and a half gains wiped out for me. Cheers mates."
                    },
                    "3": {
                        "upvotes": 49,
                        "text": "Target has a fan base second only to Costco when it comes to the retail world. Their shoppers tend to be upper middle class women and will be less impacted by both inflation and the coming recession. The Target I go to in the west suburbs of Chicago is always slammed and carts are full when there is actually stock on the shelves (been hit or miss since 2020).\n\nThe fundamentals on this just don’t make sense. I can’t see any situation where Target’s business falls apart…I just don’t see it!"
                    },
                    "4": {
                        "upvotes": 143,
                        "text": "Of course this is anecdotal, but I do want to say that my local Target is constantly understocked on groceries. There are tons of bare shelving areas, especially in the coolers/freezers. By comparison, Safeway, Costco and my local grocers Times and Foodland are well stocked. \n\nThe supply chain woes are hitting Target harder than others from what I can tell.\n\nThis is in Hawaii, by the way."
                    },
                    "5": {
                        "upvotes": 596,
                        "text": "Damn - is *every* company that posts lower-than-expected earnings going to get hit with a 25% drop?\n\nLike... those results aren't bad. They've still got good earnings, they just didn't match expectations."
                    }
                }
            },
            {
                "title": "Musk reportedly says Twitter deal at lower price 'not out of the question'",
                "text": "https://www.cnbc.com/2022/05/16/musk-reportedly-says-twitter-deal-at-lower-price-not-out-of-the-question.html\n\n\nElon Musk hinted that he could seek to renegotiate the price of his Twitter takeover, saying a deal at a lower price wasn't \"out of the question,\" Bloomberg reported Monday.\n\nThe stock has dropped as investors fear Musk will walk back on his agreement to acquire the social media company for $44 billion.\n\nMusk reportedly made the comment while speaking at a summit hosted by Chamath Palihapitiya, Jason Calacanis, David Sacks and David Friedberg for their \"All-In\" podcast.\n\n…\n\nThe stock is down more than 7% for the day investors fear Musk will walk back on his agreement to acquire the social media company for $44 billion.\n\nTwitter shares have also erased all gains made since Musk disclosed his investment in the company on April 4, in part thanks to a sell-off late last week. Musk said Friday that the acquisition was \"on hold\" while he researches the proportion of fake and spam accounts on the platform, which he believes Twitter has misstated.\n\nMusk on Monday estimated that fake users make up at least 20% of all users, according to the Bloomberg report. Twitter, meanwhile, has said the accounts made up fewer than 5% of its monetizable daily active users in the past quarter.",
                "date posted": "2022-05-16",
                "upvotes": 1366,
                "replies": {
                    "0": {
                        "upvotes": 158,
                        "text": "My Twitter puts printed some decent cash. Wish I had bought more."
                    },
                    "1": {
                        "upvotes": 1338,
                        "text": "There it is. \"This thing is crap! Sell it to me for cheap and I'll buy it!\""
                    },
                    "2": {
                        "upvotes": 170,
                        "text": "When would we find out if he sold his position?"
                    },
                    "3": {
                        "upvotes": 1017,
                        "text": "And the market manipulation goes on and on and on"
                    },
                    "4": {
                        "upvotes": 18,
                        "text": "The narrative here is so polluted with ideology and wishful thinking. Matt Levine shared his thoughts in his blog it's a good read.\n https://newsletterhunt.com/emails/21183\n\nTLDR: Musk cant simply back out of the deal. Either he cooperates with the agreed terms, they negotiate a lower price, or Twitter drags him to court to execute the agreed upon deal. Slim chance that he will be able to back out."
                    },
                    "5": {
                        "upvotes": 227,
                        "text": "He ain't buying twitter"
                    }
                }
            }
        ]
    },
    "8": {
        "date_range": [
            "2022-05-19",
            "2022-05-27"
        ],
        "posts": [
            {
                "title": "An amusing economic indicator: Strippers say a recession is guaranteed because the strip clubs are suddenly empty",
                "text": "I'm kind of a fan of amusing alternative maybe-leading indicators. Before this one, the most amusing was the \"Fluffy Puppy\" indicator, which was [flashing red a short time ago (accompanied by cute puppy video)](https://finance.yahoo.com/news/the-fluffy-puppy-indicator-signaling-a-recession-162927588.html).\n\nToday, the indicator du jour is strip club traffic.\n\nhttps://www.indy100.com/viral/stripper-recession-empty-clubs\n\n>Some strippers on Twitter said they think recession is guaranteed - because the strip clubs are suddenly empty.\n\n>On Thursday (9 May), a woman who goes by @botticellibimbo on the platform said the following about the clubs: \"The strip club is sadly a leading indicator, and I can promise y'all we r in a recession, lmao.\"\n\n>\"Me getting stock alerts just to decide whether it's worth it to go to work,\" she further wrote in a subsequent tweet.\n\n>People took to the comment section of her post to confirm her sentiments about the strip clubs, as well as their own experiences in other industries that seemed to be declining.\n\n>\"Nah fr, reading all these articles journalists and economists are like we're not in a recession we might not even get one this year or next…like the club is dead babe wym,\" one wrote.\n\n>[more]\n\n\nedit: added the fact that the video associated with the fluffy puppy indicator does in fact include puppies.",
                "date posted": "2022-05-25",
                "upvotes": 3616,
                "replies": {
                    "0": {
                        "upvotes": 344,
                        "text": "I'll need to do some research on this."
                    },
                    "1": {
                        "upvotes": 936,
                        "text": "Makes sense. Seems like strip club patronage is a pretty good indicator of discretionary spending."
                    },
                    "2": {
                        "upvotes": 2027,
                        "text": "An ex who was kindof a gold digger, really hot, texted me recently wanting to hangout. \n\nThis means 1930s level depression incoming."
                    },
                    "3": {
                        "upvotes": 267,
                        "text": "[deleted]"
                    },
                    "4": {
                        "upvotes": 59,
                        "text": "If it declines alongside only fans revenue, then that would be a better indicator."
                    },
                    "5": {
                        "upvotes": 503,
                        "text": "Are RVs still selling?"
                    }
                }
            },
            {
                "title": "Snap falls 40% on pace for worst day ever, dragging other stocks with it",
                "text": "https://www.cnbc.com/2022/05/24/snaps-down-32percent-and-its-dragging-other-stocks-down-with-it.html\n\n>Snap shares plunged 40% on Tuesday, putting the company on pace for its worst day ever and dragging down other social media and digital ad company stocks.\n\n>The tumble comes after Snap issued a warning on Monday to investors saying it won’t meet its own targets for revenue and adjusted earnings in the current quarter.\n\n>“Since we issued guidance on April 21, 2022, the macroeconomic environment has deteriorated further and faster than anticipated,” the parent company of Snapchat said in an SEC filing. Snap’s shares are down about 83% from a 52-week high in September 2021 and are off 70% year to date.\n\n>The filing also led its peers with a heavy reliance on advertising down in the afternoon. Shares of Meta were down more than 8%, Roku fell more than 15% and Pinterest dropped over 24%. Alphabet and Twitter dipped 6% and 3%, respectively.\n\n>Snap’s warning is also impacting the ad tech industry. The Trade Desk fell 18%, Magnite slipped 12% and PubMatic is also down more than 13%.\n\n>“We expect all online ad platforms to feel some impact of a significant consumer pullback,” Morgan Stanley analysts said in a Tuesday note to investors. “Advertising is cyclical.”\n\n>Fears around inflation, interest rate concerns, continued supply chain issues and the war in Ukraine have forced some advertisers and brands to rethink ad spend in the current quarter. Companies, including Snap, have been pressured into slowing hiring and cutting back costs in an effort to make up for losses.\n\n>“We see no real reason to not take Snap’s negative pre-release at face value. Digital advertising is cyclical, but like all advertising, and Macro headwinds are very likely getting much harder,” Evercore ISI analysts said in a Monday note.",
                "date posted": "2022-05-24",
                "upvotes": 1573,
                "replies": {
                    "0": {
                        "upvotes": 1054,
                        "text": "[deleted]"
                    },
                    "1": {
                        "upvotes": 407,
                        "text": "How the heck does Snapchat stock drag the rest of the market with it?"
                    },
                    "2": {
                        "upvotes": 292,
                        "text": "It's insane how many companies have fallen 50-80%+ off their ATHs, a lot of which are major names. How much farther could they really go?"
                    },
                    "3": {
                        "upvotes": 114,
                        "text": "I find it kind of insane that companies that are already down 75% still have room to drop another 43% in a single day.  Like I don't even care about Snap itself or their guidance, but that kind of stock movement is pretty damn scary."
                    },
                    "4": {
                        "upvotes": 578,
                        "text": "Company that has never made a dollar in profit loses value"
                    },
                    "5": {
                        "upvotes": 154,
                        "text": "To be fair, it’s not like anyone could have predicted the current economic situation when they put out their guidance almost three whole weeks ago."
                    }
                }
            }
        ]
    },
    "9": {
        "date_range": [
            "2022-05-27",
            "2022-06-03"
        ],
        "posts": [
            {
                "title": "Tesla CEO Reportedly Wants To Lay Off 10% Of Tesla’s Workforce As He Frets About The Economy",
                "text": "https://twitter.com/Forbes/status/1532732291658797056?s=20&t=UL8NEqc35OckpAwOxsVb9A \n\nTesla CEO wants to lay off around 10% of Tesla’s workforce due to his concerns about the state of the global economy, Reuters [reported](https://www.reuters.com/technology/exclusive-musk-says-tesla-needs-cut-staff-by-10-pauses-all-hiring-2022-06-03/) on Friday citing an internal email sent to company executives, a move that could see thousands of workers at the electric car maker lose their jobs amid growing fears of a recession. \n\nCEO sent an email on Thursday ordering a freeze on new hiring and wrote that he has a “super bad feeling” about the state of the economy.\n\nDespite the purported email, Tesla’s LinkedIn [page](https://www.linkedin.com/company/tesla-motors/jobs/) continues to show more than 5,000 active new openings at the company as of early Friday morning.",
                "date posted": "2022-06-03",
                "upvotes": 1647,
                "replies": {
                    "0": {
                        "upvotes": 594,
                        "text": "here is the full context\n\n\"Tesla will be reducing salaried headcount by 10%, as we have become overstaffed in many areas.\n\nNote, this does not apply to anyone actually building cars, battery packs or installing solar. Hourly headcount will increase.\n\nElon\"\n\nsource* \nhttps://twitter.com/WholeMarsBlog/status/1532728341865943040?s=20&t=G-AvbJyc3MVRXzdK-crCew\n\nhe doesn't exactly say how much headcount % will increase in production staff so it could still be net negative but I just wanted to share the context"
                    },
                    "1": {
                        "upvotes": 1432,
                        "text": "Return to office initiatives are stealth layoffs, change my mind."
                    },
                    "2": {
                        "upvotes": 13,
                        "text": "I don’t think I’ve ever seen Elon written as Tesla ceo"
                    },
                    "3": {
                        "upvotes": 144,
                        "text": "I wonder how many new hires got paid in stock based compensation and are currently under the strike price on that."
                    },
                    "4": {
                        "upvotes": 158,
                        "text": "lol, at the same time he's talking about humanoid robot BS. hey, I have an idea of which division to cut..."
                    },
                    "5": {
                        "upvotes": 9,
                        "text": "And so it starts. The only reason this was reported was someone leaked it. IMO - The same kind of emails and/or discussions are probably going on in companies and boardrooms across the country and probably the world."
                    }
                }
            },
            {
                "title": "Vanguard and now Fidelity are both using AWS as their cloud provider.",
                "text": "Thoughts on this?  That is 2 huge financial institutions relying on 1 cloud provider.  Although the infrastructure as a service is the best with AWS, I just get worried about 1 provider carrying that much responsibility for most US citizens 401ks and IRAs.  [Fidelity_AWS](https://www.waterstechnology.com/buy-side-technology/7947681/goodbye-data-centers-hello-cloud-fidelitys-asset-management-arm-goes-all-in-on-aws)",
                "date posted": "2022-05-29",
                "upvotes": 1132,
                "replies": {
                    "0": {
                        "upvotes": 92,
                        "text": "One cloud provider can have multiple locations to provide fault tolerance"
                    },
                    "1": {
                        "upvotes": 666,
                        "text": "If AWS goes down, it’s gonna fuck things up way more just Fidelity and Vanguard. NASA, USDA, FINRA and NASDAQ been using AWS forever. List is massive\n\nNo doubt they have a backup in place"
                    },
                    "2": {
                        "upvotes": 403,
                        "text": "I understand the concern as it sounds like there is pretty much a single point of failure to several brokers together. However, this is really not that big of a deal.\n\n- this was a move from on-prem datacenters to the cloud, meaning a much more resource-rich infrastructure \n\n- they likely use dedicated servers/hardware since 98% of services migrated, hence it is fairly safe from privacy standpoint as well\n\n- if they were able to containerize their build as a part of migration to AWS (speculating here but am fairly sure this is the case), they can either switch to multi-cloud setup or migrate altogether within weeks-months"
                    },
                    "3": {
                        "upvotes": 205,
                        "text": "I'd guess about 40% of the internet runs on AWS. Most larger sites and services have moved to cloud by now, and AWS is the largest provider."
                    },
                    "4": {
                        "upvotes": 81,
                        "text": "The companies assuredly have other fail safes in place and other providers they use too. I wouldn’t be too worried from a security perspective.\n\nIf anything, it’s a testament to the usability of AWS. Long AMZN."
                    },
                    "5": {
                        "upvotes": 22,
                        "text": "I’m a software engineer and I’m more concerned that none of the major brokers including Fidelity and Vanguard have a true two-factor authentication mechanism for personal accounts.\n\nPhishing or compromised re-used password is the most likely way personal accounts will get breached. Not only do these brokers make 2fa optional, but even when you choose the option it is weak sms/phone based 2fa that can be defeated with a sim swap or in many cases simply bypassed.\n\nPersonally I would recommend using a password manager and rotating your password every few months if you have a large balance with these brokers."
                    }
                }
            }
        ]
    },
    "10": {
        "date_range": [
            "2022-06-03",
            "2022-06-10"
        ],
        "posts": [
            {
                "title": "Inflation rose 8.6% in May, highest since 1981",
                "text": "[https://www.cnbc.com/2022/06/10/consumer-price-index-may-2022.html](https://www.cnbc.com/2022/06/10/consumer-price-index-may-2022.html)\n\n \n\nInflation accelerated further in May, with prices rising 8.6% from a  year ago for the fastest increase since December 1981, the Bureau of  Labor Statistics reported Friday.\n\nThe consumer price index, a  wide-ranging measure of goods and services prices, increased even more  than the 8.3% Dow Jones estimate. Excluding volatile food and energy  prices, so-called core CPI was up 6%, slightly higher than the 5.9%  estimate.\n\nOn a monthly basis, headline CPI was up 1% while core rose 0.6%, compared to respective estimates of 0.7% and 0.5%.\n\nSurging shelter, gasoline and food prices all contributed to the increase.\n\nEnergy  prices broadly rose 3.9% from a month ago, bringing the annual gain to  34.6%. Within the category, fuel oil posted a 16.9% monthly gain,  pushing the 12-month surge to 106.7%.\n\nShelter costs, which account  for about a one-third weighting on the CPI, rose 0.6% for the month,  the fastest one-month gain since March 2004. The 5.5% 12-month gain is  the most since February 1991.\n\nFinally, food costs climbed another 1.2% in May, bringing the year-over-year gain to 10.1%.\n\nThose  escalating prices meant workers took another pay cut during the month.  Real wages when accounting for inflation fell 0.6% in April, even though  average hourly earnings rose 0.3%. On a 12-month basis, real average  hourly earnings were down 3%.\n\nMarkets reacted negatively to the  report, with stock futures indicating a sharply lower open on Wall  Street and government bond yields rising.\n\nSome of the biggest increases came in airfares (up 12.6% on the month), used cars and trucks (1.8%), and dairy products (2.9%).\n\nFriday’s numbers dented hopes that inflation may have peaked and adds to fears that the U.S. economy is nearing a recession.\n\nThe  inflation report comes with the Federal Reserve in the early stages of a  rate-hiking campaign to slow growth and bring down prices. May’s report  likely solidifies the likelihood of multiple 50 basis point interest  rate increases ahead.\n\n“Obviously, nothing is good in this report,”  said Julian Bridgen, president of MI2 Partners, a global macroeconomic  research firm. “There is nothing in there that’s going to give the Fed  any cheer. ... I struggle to see how the Fed can back off.”\n\nWith  75 basis points of interest rate rises already under its belt, markets  widely expect the Fed to continue tightening policy through the year and  possibly into 2023. The central bank’s benchmark short-term borrowing  rate is currently anchored around 0.75% -1% and is expected to rise to  2.75%-3% by the end of the year, according to CME Group estimates.\n\nInflation has been a political headache for the White House and President [Joe Biden](https://www.cnbc.com/joe-biden/).\n\nAdministration officials pin most of the blame for the surge on supply chain issues related to [the Covid pandemic](https://www.cnbc.com/coronavirus/), imbalances created by outsized demand for goods over services, and [the Russian attack on Ukraine](https://www.cnbc.com/2022/06/10/russia-ukraine-live-updates.html).\n\nIn  a recent Wall Street Journal op-ed, Biden said he will push for further  improvements to supply chains and continue efforts to bring down the  budget deficit.\n\nHowever, he and Treasury Secretary Janet Yellen  both have emphasized that much of the responsibility for lowering  inflation belongs to the Fed. The administration has largely denied that  the trillions of dollars directed toward Covid aid played a major role.\n\nHow  much the central bank will have to raise rates remains to be seen.  Former Treasury Secretary Larry Summers recently released a white paper  with a team of other economists that suggests the Fed will need to go  further than many are anticipating. The paper asserts that the current  inflation predicament is closer to the 1980s situation than it appears  because of differences in the ways that CPI is computed then and now.",
                "date posted": "2022-06-10",
                "upvotes": 2592,
                "replies": {
                    "0": {
                        "upvotes": 1,
                        "text": "Here is the actual report, so you can read without media input: \n\nCPI for all urban consumers: https://www.bls.gov/news.release/cpi.nr0.htm\n\nLocal and regional: https://www.bls.gov/regions/subjects/consumer-price-indexes.htm"
                    },
                    "1": {
                        "upvotes": 404,
                        "text": "Well the numbers are bad… again. April was just a tease. 50bps hikes for the foreseeable future"
                    },
                    "2": {
                        "upvotes": 443,
                        "text": "[removed]"
                    },
                    "3": {
                        "upvotes": 82,
                        "text": "[removed]"
                    },
                    "4": {
                        "upvotes": 312,
                        "text": "RIP SPY"
                    },
                    "5": {
                        "upvotes": 184,
                        "text": "It's going to be yet another Red day in the market so let's not be surprised with the color of our screen later this afternoon right before the closing bell 😩"
                    }
                }
            }
        ]
    },
    "11": {
        "date_range": [
            "2022-06-10",
            "2022-06-17"
        ],
        "posts": [
            {
                "title": "Fed hikes its benchmark interest rate by 0.75%; cuts 2022 growth outlook",
                "text": "The federal reserve has increased interest rates by 75 basis points, the biggest move since 1994. The dollar has gained, and stocks have pared some gains as of posting, although still remaining positive for the day. \n\nIn the new statement, the Fed has removed the statement that household spending and business spending has remained strong, as well as its forecast that inflation will return to the 2% target while maintaining a strong labor market. \n\nOfficials also significantly cut their outlook for 2022 economic growth, now anticipating just a 1.7% gain in GDP, down from 2.8% from March.",
                "date posted": "2022-06-15",
                "upvotes": 1917,
                "replies": {
                    "0": {
                        "upvotes": 899,
                        "text": "Looks like they reiterated a long term inflation target of 2%. I’d be REALLY happy with that long term."
                    },
                    "1": {
                        "upvotes": 617,
                        "text": "Gonna raise my BAC 0.75% tonight in celebration if anyone wants to join"
                    },
                    "2": {
                        "upvotes": 190,
                        "text": "So did I wait too long to buy a house?"
                    },
                    "3": {
                        "upvotes": 450,
                        "text": "Locked my near 3% rate in January and closed. My payments would be 40% higher with today's rates. (3.125 vs 6.1)"
                    },
                    "4": {
                        "upvotes": 12,
                        "text": "Market forgot to react, I guess it will understand it properly tomorrow lmao"
                    },
                    "5": {
                        "upvotes": 134,
                        "text": "\"See if we start talking about a recession, we can hold down the long end of the curve while spiking the front end\" \n\nWatching them try to thread this needle will be entertaining at least"
                    }
                }
            },
            {
                "title": "The Fed really is fighting inflation – so don’t expect an early end to the bear market",
                "text": "[https://moneyweek.com/investments/stockmarkets/604997/federal-reserve-interest-rate-rise](https://moneyweek.com/investments/stockmarkets/604997/federal-reserve-interest-rate-rise)\n\nIn an attempt to contain raging inflation, the Federal Reserve has raised US interest rates by 0.75 percentage points. And it’s going to keep on raising them till something breaks, says John Stepek. The **“Fed put”** is dead. Or at least, the stock market level at which the Federal Reserve, the US central bank, will intervene with the soothing balm of looser monetary policy, has been lowered substantially. That much is very very clear. If anyone had any doubts, yesterday’s monetary policy decision should have set them right. The Federal Reserve isn’t playing games anymore. Yesterday, the Federal Reserve raised interest rates by three quarters of a percentage point. It’s now targeting a Federal Funds rate of 1.5-1.75%. When you think about how unthinkable that would have been just a year ago, it’s staggering. Most investors were quaking at the notion of a quarter point rate rise.  ",
                "date posted": "2022-06-16",
                "upvotes": 1693,
                "replies": {
                    "0": {
                        "upvotes": 1090,
                        "text": "If you just let inflation go rampant that’ll only make the bear market worse, fighting inflation head on is the best case scenario"
                    },
                    "1": {
                        "upvotes": 281,
                        "text": "The fed funds rate was ~2% 2018-2019 and we had market growth then, didn’t we? I remember being anxious reallocating my savings to stock when high yield accounts were paying out 2%."
                    },
                    "2": {
                        "upvotes": 259,
                        "text": "No matter what, the middle class and poor will be the one to pay the price. This may not be exactly like 2008, but the aftermath will be....\n\nThis is from the UK, but watch this: \n\nhttps://youtu.be/Of-Xq5WxpAs\n\n>The government and the Bank of England took drastic action to save the U.K. economy in the aftermath of the 2008 financial crisis. Insiders from the world of finance tell us how decisions made to solve the crisis allowed them to \"make out like bandits.\"\n\nI hope they make something like this for the US and show how the CEOs of the fortune 100s and mega wealthy got super rich after 2008 while the poor got poorer."
                    },
                    "3": {
                        "upvotes": 16,
                        "text": "only people who should be scared of bear markets is those who lost their job. If you have a steady income it basically is following the doctrine of  buy low sell high."
                    },
                    "4": {
                        "upvotes": 107,
                        "text": "What is everyone crying about? They bitched about market valuations, bitched about housing, bitched about low savings rates and now we are see the market readjustment. Swear to god I’m so sick of the crying"
                    },
                    "5": {
                        "upvotes": 563,
                        "text": "I love it. The economy should hold priority over the silly stock market"
                    }
                }
            },
            {
                "title": "This Time is Different (2001-2003 v. 2008 v. 2022)",
                "text": "I don't know how many of you are old enough to remember the Tech Bubble or The Great Recession, but I have been alive long enough to remember all of the major market corrections going back to 1973-74.  My contention is that this time is truly different.  Hear me out.\n\nDuring 2001-2003, while the overall equity markets were down each of the three years, there was still money to be made in commodities, fixed income, and precious metals.\n\nIn 2008, which is the worst market of all our lifetimes, one could make money in alternatives, fixed income (especially taxable income), and healthcare.\n\nEven in 1973-74, there was money to be made in T-Bills, T-Bonds, and real estate.\n\nThis year has been different. There is money to be made in commodities especially with energy.  The only other sector that has been profitable is agriculture.  What seems to make this different, is that the more traditional hedges against down markets such as fixed income and precious metals have been losers too. The last time we had a market that was down over -20% and the treasury bond index was negative was in 1931. It appears we are in new territory for many of us, including professionals. This is function of rising interest rates from historical lows and an uncertain future for the global economy.  Based on inflationary numbers, every country on this planet is feeling it.  \n\nHang in there folks. I won't say prepare for impact, but do prepare for a continued bumpy ride.",
                "date posted": "2022-06-17",
                "upvotes": 1505,
                "replies": {
                    "0": {
                        "upvotes": 1241,
                        "text": "The truth is that every time is ALWAYS different. The job of the investor is to evaluate each unique situation and make an assessment on what structures are in place to weather the storm. \n\nThat said, I think your assessment is correct in that the safe havens right now are even shakier and fewer than in the past bear markets."
                    },
                    "1": {
                        "upvotes": 397,
                        "text": "I just turned 31. I can wait this one out on my head while continually dumping money into the market. \n\nDo what Warren Buffet says. Be greedy when everyone is fearful. But like...don't buy shitcoins my dudes."
                    },
                    "2": {
                        "upvotes": 352,
                        "text": "[removed]"
                    },
                    "3": {
                        "upvotes": 116,
                        "text": "It's different but it rhymes.\n\nThe safe havens you  speak about were only obvious afterwards.\n\nAnd will be obvious 10 years from now what the safe havens are today.\n\nIf we knew today what the safe havens were than everybody would move into those and they would be overvalued and wouldn't be safe anymore."
                    },
                    "4": {
                        "upvotes": 161,
                        "text": "Sometimes several assets fall simultaneously. This had happened many times before. This is nothing new. It is a mistake to think the classical portfolio of US equities and a few bonds is going to give you a comfortable ride, forever, every year.\n\nIf you are **truly** diversified there will usually be something to give you a decent return. Commodities **+54%** last 12 months, gold has returned almost 5 percent over the last year, various infrastructure investments over 5%, Indonesian stock market **+15%**, a number of hedge/alternative funds have returned over 20% over the past year.\n\nDon't invest in risk assets if you can't deal with a few years of losing money. People just got too used to the lovely tech/NASDAQ bull run."
                    },
                    "5": {
                        "upvotes": 10,
                        "text": "Haha, there is pretty much zero intel in this post, which presents itself as providing a gem when you start reading it. Nothing you said before the last sentence had any influence on it, yeah okay it’s gonna be a bumpy ride."
                    }
                }
            },
            {
                "title": "Warren Buffet advice for investors is to start either early or try to outlive your peers",
                "text": "Start early, pick small companies and go all in “vigorously” as he put it in 1999, with his $30b now around $100b (so about 300% profit in 20 years). The questions are where are those companies and how someone like me can find them? Talk is easy \n\nhttps://www.moneycontrol.com/news/trends/warren-buffetts-1999-advice-on-how-to-invest-10000-is-still-relevant-today-8670271.html",
                "date posted": "2022-06-11",
                "upvotes": 1451,
                "replies": {
                    "0": {
                        "upvotes": 931,
                        "text": "Buffett's current advice to retail investors is to not try and stock pick, and just buy an S&P index fund and hold it indefinitely, investing more when it drops."
                    },
                    "1": {
                        "upvotes": 170,
                        "text": "As long as the main thing you do in your life is live as long as you can, hoard up all your money.  Just imagine how awesome your funeral can be!"
                    },
                    "2": {
                        "upvotes": 436,
                        "text": "He said that in 1999, presumably about tech companies. It's a whole different ballgame now and even back then it was just a truism of investing.  You want to make the most money in your investments? Buy undervalued stocks at small companies in a growing market.  Thanks Warren"
                    },
                    "3": {
                        "upvotes": 647,
                        "text": "[deleted]"
                    },
                    "4": {
                        "upvotes": 120,
                        "text": "I don't know which ones will make you as rich as Buffet.\n\nBut I can tell you which ones will make you as poor as Cathie Wood's fans."
                    },
                    "5": {
                        "upvotes": 39,
                        "text": "Just live longer...\n\nlike wow, why didn't I think of that?"
                    }
                }
            },
            {
                "title": "What solved the stagflation of the 70’s?",
                "text": "Hi guys,\n\nStagflation = high unemployment + high inflation \n\nWe had this in the 70’s; in this scenario if rates go up, debts get more expense and layoffs happen. Therefore unemployment goes *up*.\n\nIf rates go down and we do QE, inflation goes *up*.\n\nIf we do nothing, then inflation gets worse as it’s self re-enforcing, and unemployment gets higher as people consume less due to rising inflation and that means companies make less money leading to more layoffs…\n\nHow did the 1970’s get out of this pickle???\n\nThanks.",
                "date posted": "2022-06-12",
                "upvotes": 1162,
                "replies": {
                    "0": {
                        "upvotes": 386,
                        "text": "TL;DR: The oil crisis ended and energy prices came down and they raised interest rates and these things made inflation go down (partly due to a man made recession cuz high interest rates strangle borrowing obv) and then they reduced interest rates and the economy got better."
                    },
                    "1": {
                        "upvotes": 1911,
                        "text": "Volcker jacked rates up to 20%, caused a deep recession (two actually) and let the fallout happen.\n\nHe was hated at the time, and for years afterwards.  Many small businesses died because credit was practically non-existent for unsecured loans.\n\nToday, we have no Volcker, or indeed anyone remotely like him."
                    },
                    "2": {
                        "upvotes": 122,
                        "text": "We beat the Soviets in hockey during the 1980 Winter Olympics."
                    },
                    "3": {
                        "upvotes": 15,
                        "text": "Oil prices are the core of the issue. If the US rapidly expands exploration, production, and simultaneously invests in longer term green energy solutions & makes progress on energy independence the nasty cycle of inflation and increasing energy prices (which are the input into almost everything in the economy) will be broken."
                    },
                    "4": {
                        "upvotes": 237,
                        "text": "Volcker Rule and frankly, job losses. \n\n“Standing in line, marking time\nWaiting for the welfare dime\n'Cause they can't buy a job\nThe man in the silk suit hurries by\nAs he catches the poor old lady's eyes\nJust for fun he says, \"Get a job\" “\n\nBruce Hornsby, 1986. \n\nWelcome back. Hang on to those jobs kids."
                    },
                    "5": {
                        "upvotes": 161,
                        "text": "The oil boom of the 80s was the solution, and the tax laws being changed to make it advantageous to invest in energy were at the forefront."
                    }
                }
            }
        ]
    },
    "12": {
        "date_range": [
            "2022-06-17",
            "2022-06-24"
        ],
        "posts": [
            {
                "title": "Bitcoin drops below $20,000",
                "text": "[https://finance.yahoo.com/news/bitcoin-drops-133248611.html](https://finance.yahoo.com/news/bitcoin-drops-133248611.html)\n\nBitcoin drops below $20,000\n\nOver the weekend, bitcoin dropped below a key psychological level for buyer support, and so far has not been able to get back above it. The bitcoin ([BTC-USD](https://finance.yahoo.com/quote/BTC-USD?p=BTC-USD&.tsrc=fin-srch)) price fell below $20,000 on Saturday and is trading at $19,379 on Sunday morning, a loss of 29.36% over the past week. It briefly slipped below $18,000 on Saturday afternoon, but the price so far has rallied 1.18% over the past 24 hours. Ether ([ETH-USD](https://finance.yahoo.com/quote/ETH-USD?p=ETH-USD&.tsrc=fin-srch)), which is more intertwined with crypto’s DeFi segment that has lately wrecked havoc on the risk management strategies of significant industry players, is trading at $1,039 per coin, a loss of almost 29% in the last week. On Saturday, its price dipped below $900 before bouncing back. Crypto’s total market capitalization has dropped by almost $300 billion since last [Friday’s hot inflation data](https://finance.yahoo.com/news/may-inflation-data-june-10-2022-212834308.html), from $1.19 trillion to $891.4 billion as of Sunday morning, according to Coinmarketcap.",
                "date posted": "2022-06-19",
                "upvotes": 1533,
                "replies": {
                    "0": {
                        "upvotes": 600,
                        "text": "So we will see on Tuesday people who get their stock margin called because their crypto collateral fall in value. Bill Hwang 2.0"
                    },
                    "1": {
                        "upvotes": 407,
                        "text": "This will also be good for Bitcoin"
                    },
                    "2": {
                        "upvotes": 1010,
                        "text": "But…it’s the best inflation hedge ever!! 😂"
                    },
                    "3": {
                        "upvotes": 438,
                        "text": "There is 40-60% more downside from here. It was announced on Twitter that Celsius had a liquidation target of $18500 (edit: they added collateral to move it to $13.9k.) We went below that. Michael Saylor is currently adding more Bitcoin as collateral to his massive leveraged position at $21K. 3AC is in trouble too.\n\nPeople loaded up on margin at the $20K level, because Bitcoin bros thought we would never go below the high of a previous market cycle. \n\nAll of them are going to be flushed out of the market. When the dust settles, all of the margin will be gone, and the crypto cycle will start anew from a low price that most will not expect, because they haven't been in the crypto market for long enough to remember.\n\nBut I do. Take the high, and trim off 80-90% off of that. Historically, that's the drop for Bitcoin when we turn into a bear market. This time we have a macro recession to go with it. \n\nBe careful if you're thinking about buying here."
                    },
                    "4": {
                        "upvotes": 71,
                        "text": "Im buying when it reaches $3000."
                    },
                    "5": {
                        "upvotes": 39,
                        "text": "Dipped toe in at $17900."
                    }
                }
            }
        ]
    },
    "13": {
        "date_range": [
            "2022-06-24",
            "2022-07-01"
        ],
        "posts": [
            {
                "title": "BofA analyst sees Tesla market share of EVs falling from 70% to 11% by 2025",
                "text": "https://www.motortrend.com/news/tesla-general-motors-ford-shares-analysis-car-wars/\n\n>Tesla has held about 70 percent of the EV market share in recent years. That is forecast to drop to a mere 11 percent over the next four years, says John Murphy, the Bank of America analyst behind the annual Car Wars report that looks at the auto industry and predicts which companies are on a winning path and which are not.\n\n>Musk's apparent idea that the supposedly unsophisticated auto industry didn't know how to manufacture came back to bite him when he learned firsthand how hard it is to make cars, learned that those legacy techniques work, and was forced to adopt them. \"That was a big miss on his part,\" Murphy says.\n\nI have said before that I won't touch Tesla stock either way, because underestimating has proven a mistake, even in the face of obvious headwinds... but other manufacturers are releasing _135 EV models_ over the coming years, so something is going to stick. We've already seen demand exceeding supply for the F150 and Mach E.\n\n>\"He is launching new product at a slower rate, he does not have a full product portfolio, so there is a huge opportunity for other competitors to shoot the gap and catch up,\"\n\nTesla does not have a real SUV, they have hatchbacks. There is a huge market miss there. They don't have a truck, and that is a _huge_ moneymaker for auto manufacturers. They don't have anything compact or \"cheap.\"\n\nIt's important to note after all of this that the share of cars being EV is increasing, so even with falling market share expect their production to increase. But I don't think it's going to be 90% of the market as some Tesla bulls predict.\n\nTesla's EV market share in Europe declined from 31% in 2019 to 13% in 2020. Last month it was 10% market share. A declining share can happen.",
                "date posted": "2022-07-01",
                "upvotes": 1752,
                "replies": {
                    "0": {
                        "upvotes": 70,
                        "text": "Cybertruck looked like a car from the future and very desirable to me when it was first announced.  Then I see all the other trucks that traditional car makers are announcing and my brain goes, maybe I prefer those instead.  Cybertruck still cool but not something I vastly prefer over other alternatives anymore."
                    },
                    "1": {
                        "upvotes": 722,
                        "text": "Your Exhibit A, when multiple big fish enter the market, is Netflix."
                    },
                    "2": {
                        "upvotes": 355,
                        "text": "There are two jobs where you can be wrong as many times and get away with it. Weatherman and stock analyst."
                    },
                    "3": {
                        "upvotes": 410,
                        "text": "The Elon stans are coming! Brace yourself!"
                    },
                    "4": {
                        "upvotes": 137,
                        "text": "I am seeing in last year or so, people going out of their way to not buy Tesla. They would buy Kia, Mustang, VW, even Polestar.. but a lot more companies have their cars on the road now and creating intrigue"
                    },
                    "5": {
                        "upvotes": 52,
                        "text": "BofA analysts been very vocal in my newsfeeds lately... It's suspicious. And I don't even own any Tesla FWIW."
                    }
                }
            },
            {
                "title": "So real talk, where are the workers?",
                "text": "Unemployment rate 3.6%, 2 openings for every unemployed person, etc. Basically there are millions who don't have a job **and** are not looking for a job.\n\nAnecdotally I see how bad it is as I am sure everyone else does too. My local restaurants have poor services and close early due to staffing issues. Airlines are cancelling flights. Companies have drastically lowered their standards for hiring. I can go on...\n\nI am still scratching my head why we still have this issue long after government handouts ended.\n\nI know many have retired and most of them will probably never return to the workforce. But I suspect they make up a relatively small portion of the supply shortage of workers. I have questions about the rest. Are they living on sustenance level somewhere and gave up on the rat's race? Where are the able-bodied workers who for whatever reason are not working and why are they not working? Why is my local McDonalds still so understaffed? ",
                "date posted": "2022-06-29",
                "upvotes": 1219,
                "replies": {
                    "0": {
                        "upvotes": 1,
                        "text": "This post is now locked since it's diverged from being a discussion about investing."
                    },
                    "1": {
                        "upvotes": 2928,
                        "text": "I think a huge factor is the rising cost of child care. Lots of parents are having to have an entire income devoted to child care. At that’s point you can just raise your own kid for the same cost, you might as well at least get to experience it."
                    },
                    "2": {
                        "upvotes": 998,
                        "text": "When everything was shut down millions were laid off or quit for lack of work. Many of those close to retirement age didn't bother to come back and simply retired early while the younger ones used this opportunity to look for better jobs or used their freed up time to get more education and qualifications.\n\nAlso the pandemic showed that many jobs can easily be done from home and that you won't get rich by working anyway. Why break your back in a shitty job that pays shitty wages if there are easier alternatives? They won't make you any richer but at least they don't cost you your physical and mental health.\n\nBusinesses like fast food restaurants and retailers will have trouble finding workers for a long time. Those not able to pay higher wages will go out of business."
                    },
                    "3": {
                        "upvotes": 330,
                        "text": "> I know many have retired and most of them will probably never return to the workforce. But I suspect they make up a relatively small portion of the supply shortage of workers.\n\nI recently read an article that covered this issue either by PBS Newshour or NPR, I forget which, but the general gist of it was that the 65+ crowd had left the labor force in droves, and that group actually was the biggest contributor to the current labor situation."
                    },
                    "4": {
                        "upvotes": 1123,
                        "text": "My theory is that we've had a 'shifting-upwards' during the pandemic. \n\nDue to the equity gains, the being told to stay at home, even possible job loss, a lot of people in their 50s who were 5 years or less from retirement took a look at their lives and decided they could/would just bring retirement forward.\n\nThis opened up a lot of senior positions which were filled by the mid-level employees within companies. The junior employees moved to the middle positions. That leaves the junior positions open. Where can we get some junior employees? Why, how about that guy at Starbucks with a degree who we declined for an internship a couple of years ago?\n\nAnd now Starbucks have no staff.\n\nSo basically the workers that disappeared were the top level, but the vacancies are being seen at lower levels. There were a ton of people working in jobs which they were over-qualified for, who have now found something more suitable, but because it's happened so quickly it's left a yawning chasm"
                    },
                    "5": {
                        "upvotes": 172,
                        "text": "IT person here\n\na lot of job openings have some very specific requirements on them, also they do not list salary and want to get away with paying nothing."
                    }
                }
            },
            {
                "title": "Crypto hedge fund Three Arrows Capital has entered liquidation, source says",
                "text": "[https://www.reuters.com/technology/crypto-hedge-fund-three-arrows-capital-has-entered-liquidation-source-says-2022-06-29/](https://www.reuters.com/technology/crypto-hedge-fund-three-arrows-capital-has-entered-liquidation-source-says-2022-06-29/)\n\n LONDON, June 29 (Reuters) - Crypto hedge fund Three Arrows Capital (3AC) has entered liquidation, a person familiar with the matter told Reuters on Wednesday, in the latest sign of the market downturn hurting the crypto industry. Singapore-based 3AC is one of the higher profile crypto investors to have run into difficulties following the sharp sell-off in the market for digital currencies seen in recent months. Crypto broker Voyager Digital issued 3AC with a default notice on Monday after it failed to make payments on a loan of 15,250 bitcoin (approximately $324 million) and $350 million worth of USDC, a stablecoin",
                "date posted": "2022-06-29",
                "upvotes": 1118,
                "replies": {
                    "0": {
                        "upvotes": 318,
                        "text": "Reminder: When you reach 11 digits take some profit."
                    },
                    "1": {
                        "upvotes": 488,
                        "text": "8-20% yields in a 0% rate environment wasn't sustainable?!"
                    },
                    "2": {
                        "upvotes": 108,
                        "text": "A hedge fund that was fully leveraged long as the market crashed.  Ouch."
                    },
                    "3": {
                        "upvotes": 81,
                        "text": "One of the first of many."
                    },
                    "4": {
                        "upvotes": 12,
                        "text": "*Cue Another one bites the dust*"
                    },
                    "5": {
                        "upvotes": 41,
                        "text": "They’re all scams when they offer stupid high interest/yield rates."
                    }
                }
            }
        ]
    },
    "14": {
        "date_range": [
            "2022-07-01",
            "2022-07-08"
        ],
        "posts": [
            {
                "title": "GameStop fires its CFO and announces layoffs as part of an aggressive turnaround plan",
                "text": "GameStop fires its CFO and announces layoffs as part of aggressive turnaround plan\n\n[https://www.cnbc.com/2022/07/07/gamestop-cfo-is-leaving-the-company-retailer-announces-layoffs.html](https://www.cnbc.com/2022/07/07/gamestop-cfo-is-leaving-the-company-retailer-announces-layoffs.html)",
                "date posted": "2022-07-07",
                "upvotes": 2362,
                "replies": {
                    "0": {
                        "upvotes": 694,
                        "text": "Heres the full memo from the CEO for those too lazy to click the link.\n\n\" All,\n\nChange will be a constant as we evolve our commerce business and launch new products through our blockchain group. After investing heavily in personnel, technology, inventory and supply chain infrastructure over the past 18 months, our focus is on achieving sustained profitability. This means eliminating excess costs and operating with an intense owner’s mentality. Everyone in the organization must become even more hands-on and embrace a heightened level of accountability for results.\n\nWith that said, I’m getting in touch today to share three organizational updates:\n\n1.  After making more than 600 corporate hires in 2021 and the first half of 2022, we have a stronger understanding of our transformation needs. This has positioned us to right-size headcount across several corporate departments. Today, we’re making a number of reductions to help us keep things simple and operate nimbly with the right talent in place.\n\n2. We’re going to be making a significant investment in our Store Leaders and field employees, who play a critical role fulfilling the needs of our customers. These individuals are, in many respects, the heart of GameStop. We’ll be sharing details regarding this investment in the coming weeks.\n\n3. Mike Recupero, who has served as our Chief Financial Officer since last June, is departing. Diana Jajeh, who has been our Chief Accounting Officer and possesses strong institutional knowledge of the business, has been appointed Chief Financial Officer.\n\nThese changes will enable us to operate in a profitable manner as we execute against our strategy of pursuing sales growth in our commerce business and launching new products that empower customers within the digital asset and web3 gaming verticals. I’m confident in the team we have in place going forward, and thank you again for your continued dedication and focus.\n\nRegards,\nMatt \""
                    },
                    "1": {
                        "upvotes": 61,
                        "text": "GameStop has been such a fun company to watch during times of financial crisis lol"
                    },
                    "2": {
                        "upvotes": 320,
                        "text": "Tough break for the CFO but he will recupero."
                    },
                    "3": {
                        "upvotes": 153,
                        "text": "Lol at announcing a 4:1 split and firing CFO in the same week."
                    },
                    "4": {
                        "upvotes": 114,
                        "text": "That escalated quickly"
                    },
                    "5": {
                        "upvotes": 32,
                        "text": "Anyone have some insight as to why SIMPQ pumped so hard the day they announced the dividend? Or why it seems dead tickers like Sears also tend to spike when GME spikes?"
                    }
                }
            },
            {
                "title": "Musk terminates twitter deal",
                "text": "https://www.reuters.com/technology/elon-musk-terminating-twitter-deal-2022-07-08/\n\n\nTesla (TSLA.O) Chief Executive Officer Elon Musk said on Friday he was terminating his $44 billion deal for Twitter Inc (TWTR.N), citing material breach of multiple provisions of the agreement.\n\nShares of Twitter fell 6% in extended trading.\n\nThe announcement brings to an end a will-he-won't-he saga after the world's richest person clinched a deal for Twitter in April but then put the buyout on hold until the social media company proved that spam bots accounted for less than 5% of its total users.",
                "date posted": "2022-07-08",
                "upvotes": 1850,
                "replies": {
                    "0": {
                        "upvotes": 1,
                        "text": "As a reminder - this is an investing subreddit. It's not to discuss Elon Musk and his various whims, personal life, or tweets  - you can do that at r/elonmusk or someplace else. Low effort comments will be removed. Uncivil comments will result in bans.\n\n\\[edit\\]\n\nThere have been some questions about what's in the merger agreement, etc. And I see some thoughtful comments about the MAE provisions. \n\nFor those people who unfamiliar with how merger agreements work and want to actually read it - the executed copy of the agreement and plan of merger are filed in the 8k here - [https://www.sec.gov/Archives/edgar/data/1418091/000119312522120474/d310843ddefa14a.htm](https://www.sec.gov/Archives/edgar/data/1418091/000119312522120474/d310843ddefa14a.htm)   \nThe 14a filing with the FAQ can be found here - [https://www.sec.gov/Archives/edgar/data/0001418091/000119312522152250/d283119dprem14a.htm](https://www.sec.gov/Archives/edgar/data/0001418091/000119312522152250/d283119dprem14a.htm)"
                    },
                    "1": {
                        "upvotes": 1206,
                        "text": "Gonna be some neat lawsuits around this saga. Entertainment for years."
                    },
                    "2": {
                        "upvotes": 925,
                        "text": "[deleted]"
                    },
                    "3": {
                        "upvotes": 121,
                        "text": "I'm glad I followed my [peasant perspective](https://www.reddit.com/r/investing/comments/ubsnxd/elon_musk_to_acquire_twitter/i664gi2/?context=3)"
                    },
                    "4": {
                        "upvotes": 98,
                        "text": "Can’t wait for Matt Levine on Monday"
                    },
                    "5": {
                        "upvotes": 193,
                        "text": "I sold the pop on April 4th at around \\~$50/sh. I don't typically try to time the market, but very pleased with myself here :)"
                    }
                }
            },
            {
                "title": "Meta is pulling the plug on its failed crypto project this September",
                "text": "[https://fortune.com/2022/07/01/meta-novi-crypto-payments-wallet-end-september-2022/](https://fortune.com/2022/07/01/meta-novi-crypto-payments-wallet-end-september-2022/)\n\nThe remainder of the cryptocurrency project that Meta Platforms Inc.’s Founder Mark Zuckerberg took a beating over from Congress is officially shutting down. Meta’s Novi pilot—a money-transfer service using the company’s own cryptocurrency digital wallet—will end on Sept. 1, the service said on its website, a link to which it texted to its users. Both the Novi app and Novi on WhatsApp will no longer be available, the company said on the Website. Starting July 21, users will no longer be able to add money to their accounts, Novi said, advising users to withdraw their balance “as soon as possible.” Users won’t be able to access their transaction history or other data after the pilot ends. The company does plan to use Novi’s technology in future products, such as in its metaverse project, a company spokesperson said in an email. “We are already leveraging the years spent on building capabilities for Meta overall on blockchain and introducing new products, such as digital collectibles,” Meta said in the statement. “You can expect to see more from us in the web3 space because we are very optimistic about the value these technologies can bring to people and businesses in the metaverse.”\n\nThe stock has been cut by more than half in 2022. Although Wall Street has been in a buying mood last week, real world pressures continue to make META stock one to avoid. Alternatively, if investors can’t help but like META stock at current prices, I’d similarly point to a long vertical spread using call contracts or a fully hedged collar for those interested in owning shares. But again, the belief is those efforts will be in vain and only serve the purpose of vastly reducing downside risk.\n\nMeta Platforms has many issues to contend with. For example, Facebook Reels’ inability to challenge top rival TikTok, Alphabet’s (NASDAQ:GOOG, NASDAQ:GOOGL) YouTube in long form video, competition in ecommerce from Google and Amazon (NASDAQ:AMZN), falling consumer brand value and Meta’s risky metaverse pivot, which might overlook its existing platforms.\n\n&#x200B;",
                "date posted": "2022-07-03",
                "upvotes": 1833,
                "replies": {
                    "0": {
                        "upvotes": 526,
                        "text": "[deleted]"
                    },
                    "1": {
                        "upvotes": 64,
                        "text": "This actually seems like a rational business function. They explored a new space, learned it wasn’t in the business’s interest and moved on."
                    },
                    "2": {
                        "upvotes": 68,
                        "text": "Reddit would rather buy Tesla at 1200 than buy Meta at its current price. Always inverse Reddit."
                    },
                    "3": {
                        "upvotes": 90,
                        "text": "Lol so they're moving from crypto to nft's..."
                    },
                    "4": {
                        "upvotes": 212,
                        "text": "Agreed. Meta is a junky Value stock atm."
                    },
                    "5": {
                        "upvotes": 135,
                        "text": "I've said it many times: Zuckerberg had one great idea and none since, and it's becoming increasingly obvious he's not got it in him."
                    }
                }
            },
            {
                "title": "GameStop board approves stock split plan, shares rise",
                "text": " [https://www.reuters.com/markets/us/gamestop-announces-four-for-one-stock-split-2022-07-06/](https://www.reuters.com/markets/us/gamestop-announces-four-for-one-stock-split-2022-07-06/)\n\nJuly 6 (Reuters) - GameStop Corp [**(GME.N)**](https://www.reuters.com/companies/GME.N) said on Wednesday its board has approved a four-for-one stock split, sending the video game retailer's shares up more than 5% in extended trading.\n\nThe \"meme stock\" company in March sought shareholder approval for the split, planning to increase its outstanding Class A common shares to 1 billion from 300 million in a bid to make it easier for retail investors to own its stock\n\nPersonally haven’t bought a share, the entire GME community is massive\nand despite GME’s attempt to advance the expansion of ‘GME hype’, I can see it dying down; the fall of Mixer has opened up a position as a competitor with twitch; NFT’s seem to be making a big mark in their expansion as NFT made specific for games can sell easily as premium merchandise: still personal too volatile to get into and overvalued although it’s a solid article and fun to follow GME and the crowd",
                "date posted": "2022-07-06",
                "upvotes": 1339,
                "replies": {
                    "0": {
                        "upvotes": 1,
                        "text": "This post has been preemptively locked to avoid the spread of misinformation about how stock splits work. \n\n\\[edit\\] - the topic has been explained in the past. But for anyone that doesn't understand why some companies call it a \"stock split in the form of a stock dividend\" - it describes the way that the bookkeeping is done to account for the split.\n\nIn this case, it involves a journal entry by moving the amount from retained earnings to paid-in capital instead of simply adjusting the par value of the shares.\n\nExample and more detailed explanation here - [https://www.principlesofaccounting.com/chapter-14/splits-and-dividends/](https://www.principlesofaccounting.com/chapter-14/splits-and-dividends/)\n\nIf you have a question about how stock splits work - please ask in the Daily Discussion thread."
                    },
                    "1": {
                        "upvotes": 323,
                        "text": ">bid to make it easier for retail investors to own its stock\n\nHonestly how many investors are waiting on the side lines because they cannot afford $120 shares but can afford $30? In the USA lots of brokers now even have fractional shares so I really don't see the point in this except to drum up news for the company"
                    },
                    "2": {
                        "upvotes": 102,
                        "text": "Lol"
                    },
                    "3": {
                        "upvotes": 50,
                        "text": "Before the cult comes and brigades spreading false info. The split does not change the underlying valuation or mechanics of the company. The 'shorts' will automatically be shorting 4x the amount of stock at 0.25x the price on the day the split takes place. It turns a 1x $120 bet into 4x $30 bet. $120 = $120. Literally has no effect on shorts' or longs' net position. Finding the 3 extra shares to pay as a 'dividend' is not difficult as the amount of outstanding shares on the market is literally multiplied by 4. Will the shares go up the following day after this news? Sure, it's more attractive to investors as price is lower but it doesn't change the fundamental and underlying valuation of the company."
                    },
                    "4": {
                        "upvotes": -67,
                        "text": ">in a bid to make it easier for retail investors to own its stock\n\nBut it's only like $100 a pop. So silly how a company's perceived value can rise 6% on such a non-event lol."
                    }
                }
            }
        ]
    },
    "15": {
        "date_range": [
            "2022-07-08",
            "2022-07-15"
        ],
        "posts": [
            {
                "title": "Inflation rose 9.1% in June, even more than expected, as price pressures intensify",
                "text": "&#x200B;\n\n[https://www.cnbc.com/2022/07/13/inflation-rose-9point1percent-in-june-even-more-than-expected-as-price-pressures-intensify.html](https://www.cnbc.com/2022/07/13/inflation-rose-9point1percent-in-june-even-more-than-expected-as-price-pressures-intensify.html)\n\n The consumer price index for June was expected to rise 8.8% from a year ago, according to Dow Jones estimates. \n\n \n\nShoppers paid sharply higher prices for a variety of goods in June as  inflation kept its hold on a slowing U.S. economy, the Bureau of Labor  Statistics reported Wednesday.\n\nThe consumer price index, a broad  measure of everyday goods and services, soared 9.1% from a year ago,  above the 8.8% Dow Jones estimate. That marked another month of the  fastest pace for inflation going back to December 1981.\n\nExcluding volatile food and energy prices, so-called core CPI increased 5.9%, compared to the 5.5% estimate.\n\nOn a monthly basis, headline CPI rose 1.3% and core CPI was up 0.7%, compared to respective estimates of 1.1% and 0.5%.",
                "date posted": "2022-07-13",
                "upvotes": 2542,
                "replies": {
                    "0": {
                        "upvotes": 1,
                        "text": "[CPI](https://www.bls.gov/news.release/pdf/cpi.pdf)"
                    },
                    "1": {
                        "upvotes": 1461,
                        "text": "Here's the pattern from the last couple of months. \n\n1) CPI data released and it's high\n\n2) Everyone freaks out for a week\n\n3) Things recover a little bit and people start to call peak inflation\n\n4) Everyone becomes optimistic over the next couple of weeks and start pricing in a new rate hike \n\n5) CPI data comes out and it's high"
                    },
                    "2": {
                        "upvotes": 91,
                        "text": "Imagine the cost of college tuition in coming years, yikes."
                    },
                    "3": {
                        "upvotes": 567,
                        "text": "Another month, another pay cut. Inflation is supposed to be so slow you don’t notice it …"
                    },
                    "4": {
                        "upvotes": 24,
                        "text": "[deleted]"
                    },
                    "5": {
                        "upvotes": 138,
                        "text": "100 Dollar menu incoming"
                    }
                }
            },
            {
                "title": "Twitter Says It Can Beat Musk’s Claims in Four Trial Days",
                "text": "(Bloomberg) -- Twitter Inc. wants a lightning-quick trial to resolve its claim that billionaire Elon Musk wrongfully canceled his proposed $44 billion buyout of the social-media platform.\n\nLawyers for the San Francisco-based company say they need only four days in Delaware Chancery Court to prove that the world’s richest man should be forced to honor his agreement and pay $54.20 a share for Twitter. The company hopes to start the non-jury case on Sept. 19. Legal experts, however, predict the case will take about two weeks to try.\n\nUnlike some states where it can take several years to get a case to trial, Delaware Chancery Court generally moves quicker. Chancery judges -- business law experts -- are known for being able to parse through the legal thickets of complex merger and acquisition disputes more quickly and thoroughly than other US courts. Even complex business cases are often argued before a judge within six or seven months of being filed.\n\nThe Twitter buyout agreement specifies all legal disputes over the deal must be heard in Delaware, corporate home to more than half of U.S. public companies, including Twitter and Musk’s Tesla Inc..\n\nMusk and his lawyers didn’t immediately return emails Tuesday seeking comment on both the suit and whether the case can be tried on Twitter’s schedule. Musk did issue a tweet Tuesday, saying: “Oh the irony lol.”\n\nA judge hasn’t yet been assigned to the case, but Chief Judge Kathaleen St. J. McCormick already has taken on investor suits over the teetering transaction. She may pick up Twitter’s suit as well. McCormick, a Delaware native, is a former legal-aid lawyer and graduate of Notre Dame Law School.\n\nTwitter’s legal team argues it can easily show in less than a week of court time that Musk didn’t have legitimate grounds to nix the $54.20-per-share buyout. Twitter shares rose 8.1% to $36.83 at 3:01 p.m. Wednesday.\n\n“Litigation on the schedule Twitter proposes permits the parties and their experienced counsel ample time to assemble a trial record,” the lawyers wrote.\n\nThat would provide enough time for a judge to rule and have the Delaware Supreme Court review the ruling before the Oct. 24 closing date for the transaction, the lawyers said.\n\nCharles Elson, a retired University of Delaware finance professor and former head of the school’s Weinberg Center for Corporate Governance, says don’t bet on it.\n\n“I’d say a four-day trial is way more than optimistic,” Elson said Wednesday in an interview. “There’s a lot of water under the bridge on this deal and I’d say it going to take more like 10 days to try it.”\n\nLast year, Musk traveled to Delaware for over challenge from Tesla investors to his more than $2 billion purchase of renewable-power provider SolarCity, a company he founded with his cousins. That case ate up 10 trial days. A judge ultimately concluded Musk didn’t force an overpriced SolarCity acquisition down the throats of his fellow Tesla directors.\n\nVia: [https://finance.yahoo.com/news/twitter-lawyers-prevail-over-musk-002444854.html](https://finance.yahoo.com/news/twitter-lawyers-prevail-over-musk-002444854.html)",
                "date posted": "2022-07-14",
                "upvotes": 1836,
                "replies": {
                    "0": {
                        "upvotes": 266,
                        "text": "I will laugh so hard if Twitter bans Elon. Why would you host someone you are in a legal dispute with"
                    },
                    "1": {
                        "upvotes": 888,
                        "text": "I think Elon got buyers remorse. He started thinking about all the other stuff he could buy for 44 billion dollars"
                    },
                    "2": {
                        "upvotes": 227,
                        "text": "[removed]"
                    },
                    "3": {
                        "upvotes": 434,
                        "text": "Elon thinks posting memes would win him the case."
                    },
                    "4": {
                        "upvotes": 77,
                        "text": "As I read it, the arbitrage players are assuming a price around $39-40/share with them reaching a settlement by end of September.   The arbitrages did not make a move until the complaint was filed."
                    },
                    "5": {
                        "upvotes": 241,
                        "text": "if they get him to buy it, what would happen with the share price, go to that point and quickly down again?"
                    }
                }
            },
            {
                "title": "China crushes mass protest by bank depositors demanding their life savings back",
                "text": "It looks like there's bank runs happening in China, but no one seems to be talking about it much on here?\n\nFrom CNN:\n\n\"Since April, four rural banks in China's central Henan province have frozen millions of dollars worth of deposits, threatening the livelihoods of hundreds of thousands of customers in an economy already battered by draconian Covid lockdowns.\nAnguished depositors have staged several demonstrations in the city of Zhengzhou, the provincial capital of Henan, over the past two months, but their demands have invariably fallen on deaf ears.\nOn Sunday, more than 1,000 depositors from across China gathered outside the Zhengzhou branch of the country's central bank, the People's Bank of China, to launch their largest protest yet, more than half a dozen protesters told CNN.\"\n\nFull article [here](https://edition.cnn.com/2022/07/10/china/china-henan-bank-depositors-protest-mic-intl-hnk/index.html) \n\nWhat exactly does all this mean for the global markets? I was look at a thread on r/worldnews earlier and people seem to think this is Great Depression levels of bad, which I'm guessing it isn't if it's not getting as much attention as even Evergrande was.\n\nSo what do we think? Is this a non-issue for global markets (in light of current pressures), or at we look at global economic catastrophe?",
                "date posted": "2022-07-11",
                "upvotes": 1815,
                "replies": {
                    "0": {
                        "upvotes": 272,
                        "text": "They are called \"the village banks\" for reasons. Originated from local farmers' credit unions, these cluster banks are loosely regulated and monitored. One businessman bribed the bank officials and essentially took control of the village bank clusters and used them as a \"shell\" to finance his own investment. At the end of last year, he transferred most of the money to the US and left the village bank bankrupt. It is interesting that the latest protest target the largest bank, PBOC, instead of the bankcrupted village banks. It is like protest in front of Federal Reserve."
                    },
                    "1": {
                        "upvotes": 437,
                        "text": "Small Chinese banks have been seeing bank runs for years. It's actually not anything new. That being said, ponzis ***do*** collapse, but they will likely try to paper over this with liquidity and control as they've done for years. That being said, this is a small bank. If a small community US Bank went out of business, nobody would care. This isn't exactly Lehman failing here.\n\nThe issue here is that commodity prices, reduction in Chinese export capacity, and rising price of the US Dollar all mean that it's more and more difficult for China to provide the liquidity necessary to keep their banks running smoothly."
                    },
                    "2": {
                        "upvotes": 127,
                        "text": "Its not really a systemic issue. Some criminal scamsters got hold of some small rural banks and used them to run scams and now folks are mad they lost all their savings, because who wouldn't be? \n\nBut the larger Chinese banking system itself is not run this way. They were not offering crazy high interest rates like these banks were. I don't think this will have a big impact on the larger banking system \n\nsomeone with more knowledge feel free to correct me."
                    },
                    "3": {
                        "upvotes": 114,
                        "text": "[removed]"
                    },
                    "4": {
                        "upvotes": 12,
                        "text": "Many people here are wondering why the Chinese version of FDIC insurance didn’t do anything. Let me explain why. \n\nFDIC insurance only works on “deposits”, “deposits” is the keyword here. The bank in the news actually scam their customers to let them believe some of their fixed income investment products to be “deposits”. Imagine every marketing material you see online and every banker in their branches tell you that it is bank deposits but it is actually not. This is actually the bank regulator’s fault to not have caught these kind of scams before it becomes a big problem. But now the damage has already been done, since these money has never been “deposits” thus no insurance money is paid, the Chinese version of FDIC naturally refuse to pay the victims."
                    },
                    "5": {
                        "upvotes": 22,
                        "text": "The Henan financial regulatory agency issued a notice that the govt will formulate solutions ASAP to protect the interests of depositors.\n\nThe local police announced that bankers and other criminals involved in financial fraud had been arrested.\n\nA few criminals have escaped to the US, but the US and China have no extradition agreement so they're safe."
                    }
                }
            },
            {
                "title": "Home Sales Are Getting Canceled at the Highest Rate Since the Start of the Pandemic",
                "text": "According to Redfin, home contracts are falling at the fastest rate since March / April 2020.\n\nFor context, the fall out rate from home buying contracts hovered at a steady \\~12% for three years leading up to the Pandemic. Homes are now falling out of contract 14.9% of the time for June 2022. This is not a dramatic fall-out rate yet but I think it will be interesting to keep an eye on. It seems buyers are more likely to have contingencies and are either forced to pull-out (because of higher interest rates) or not afraid to pull out of a contract.\n\n[https://www.businesswire.com/news/home/20220711005232/en/Home-Sales-Are-Getting-Canceled-at-the-Highest-Rate-Since-the-Start-of-the-Pandemic](https://www.businesswire.com/news/home/20220711005232/en/Home-Sales-Are-Getting-Canceled-at-the-Highest-Rate-Since-the-Start-of-the-Pandemic)\n\nThis of course does not mean the housing market will crash but at the very least it seems we are going back to a balanced market where buyers at least have room to negotiate contingencies such as inspection.\n\nIn addition, it might also mean that Buyers were not able to lock in a lower interest rate for long enough after putting in an offer, and unable to afford the newer higher rate by the time closing happens.",
                "date posted": "2022-07-12",
                "upvotes": 1112,
                "replies": {
                    "0": {
                        "upvotes": 662,
                        "text": "My guess - financing became an issue and too risky for lenders. I think this is a good sign."
                    },
                    "1": {
                        "upvotes": 137,
                        "text": "Anecdotal obviously, but I have been looking for 6 months and just bought a home.\n\nEven a few months ago there would be dozens of offers per sale, and most were all cash and above asking price. I was once outbid by someone who bid $200k over asking price, all cash. \n\nI just closed escrow on a home that only had 3 offers, and I got it for $90k less than asking. Things are changing."
                    },
                    "2": {
                        "upvotes": 30,
                        "text": "At 2.5 interest on $1M youre paying almost the same on a 30yr loan as 6.5% on $600,000\n\nA lot of people's purchasing power changed dramatically in 6 months."
                    },
                    "3": {
                        "upvotes": 19,
                        "text": "> In addition, it might also mean that Buyers were not able to lock in a lower interest rate for long enough after putting in an offer, and unable to afford the newer higher rate by the time closing happens.\n\nThis is me. Unable to buy a place while the interest rates were low because I kept getting outbid. Unable to buy a place now because the cost is too high with the increased interest rates."
                    },
                    "4": {
                        "upvotes": 238,
                        "text": "It would be nice if we saw some gradual, sensible price correction. \n\nNo chance, but it would be nice."
                    },
                    "5": {
                        "upvotes": 8,
                        "text": "I definitely see a bubble. I know several people who got their PPP loan, and immediately used it as a downpayment on a home, then used the added equity, to buy another, and so on... It's starting to rhyme with 2008"
                    }
                }
            }
        ]
    },
    "16": {
        "date_range": [
            "2022-07-15",
            "2022-07-22"
        ],
        "posts": [
            {
                "title": "Judge grants Twitter fast-track trial to decide fate of Musk deal",
                "text": "Judge grants Twitter fast-track trial to decide fate of Musk deal  - https://on.ft.com/3PnVmcE via @FT\n\n >Twitter won an early victory in its legal battle to force Elon Musk to complete his $44bn takeover of the company, after a judge sided with the social media company and set a timetable for a fast-track trial starting in October.",
                "date posted": "2022-07-19",
                "upvotes": 2601,
                "replies": {
                    "0": {
                        "upvotes": 798,
                        "text": "[removed]"
                    },
                    "1": {
                        "upvotes": 540,
                        "text": "This is one time that going off half-cocked is going to cost Musk some real money."
                    },
                    "2": {
                        "upvotes": 496,
                        "text": "Is there a realistic scenario where he gets forced to buy Twitter for $44 billion?  Or is it more likely they would settle and Twitter walks away with a bunch of extra cash?\n\nI've never really followed one of these types of disputes and I'm interested in hearing what people think."
                    },
                    "3": {
                        "upvotes": 101,
                        "text": "This guys pullout game is a complete disaster."
                    },
                    "4": {
                        "upvotes": 21,
                        "text": "I wouldn’t mind seeing Elon take a “L”. Maybe it will humble him a little. He’s been manipulating the market long enough."
                    },
                    "5": {
                        "upvotes": 194,
                        "text": "I sure hope they’re looking into if he sold any twitter shares after the fake announcement boosted the price."
                    }
                }
            },
            {
                "title": "Mortgage demand drops to a 22-year low as higher interest rates and inflation crush homebuyers",
                "text": "* Surging inflation and interest rates are hammering American consumers and weighing on the housing market.\n\n* Mortgage demand fell last week, hitting the lowest point since 2000, according to the Mortgage Bankers Association.\n\n* Buyers have lost considerable purchasing power as rates have almost doubled since earlier this year.\n\n\n\nThe pain in the mortgage market is only getting worse as higher interest rates and inflation hammer American consumers.\n\nMortgage demand fell more than 6% last week compared with the previous week, hitting the lowest level since 2000, according to the Mortgage Bankers Association’s seasonally adjusted index.\n\nApplications for a mortgage to purchase a home dropped 7% for the week and were 19% lower than the same week in 2021. Buyers have been contending with high prices all year, but with rates almost double what they were in January, they’ve lost considerable purchasing power.\n\n“Purchase activity declined for both conventional and government loans as the weakening economic outlook, high inflation and persistent affordability challenges are impacting buyer demand,” said Joel Kan, an economist for the MBA.\n\nWhile buyers are less affected by weekly moves in interest rates, the broader picture of rising rates has already taken its toll. Mortgage rates moved higher again last week after falling slightly over the past three weeks.\n\nThe average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances ($647,200 or less) increased to 5.82% from 5.74%, with points increasing to 0.65 from 0.59 (including the origination fee) for loans with a 20% down payment. That rate was 3.11% the same week one year ago.\n\nDemand for refinances, which are highly rate sensitive, fell 4% for the week and were 80% lower than the same week last year. Those applications are also at a 22-year low, but the drop in demand from homebuyers caused the refinance share of mortgage activity to increase to 31.4% of total applications from 30.8% the previous week.\n\nMortgage interest rates haven’t moved much this week, but that could change very soon due to increasing bond market volatility. The Federal Reserve is expected to hike rates by another 75 basis points next week, and other central banks are taking similar action against inflation. A basis point equals 0.01%.\n\n“This is especially true next week as markets digest the newest Fed policy announcement next Wednesday, but Thursday’s policy announcement from the European Central Bank could also cause enough of a stir to impact U.S. rates,” noted Matthew Graham, chief operating officer of Mortgage News Daily.\n\n\nhttps://www.cnbc.com/2022/07/20/mortgage-demand-drops-to-lowest-level-in-22-years.html",
                "date posted": "2022-07-20",
                "upvotes": 2266,
                "replies": {
                    "0": {
                        "upvotes": 85,
                        "text": "I see a lot of mortgage operations people on LinkedIn in practically begging for work. I think they might want to go into another career path, because the mortgage industry is going to be rough for a little while."
                    },
                    "1": {
                        "upvotes": 301,
                        "text": "Does this mean home renovations should be going down? With builders reluctant now, I would think by spring 2023 renovators aren't going to be able to charge as much (assuming supply chains pick up, the labor market broadens, and inflation gets under control.)\n\nAt least, this is my wishful thinking ;)"
                    },
                    "2": {
                        "upvotes": 127,
                        "text": "The rates arent nearly as awful as the price tags. My area saw 40-50000 homes soar into 80-90 range in a matter of months. Still there too. Were talking 2 bedroom house with problems in a flood zone."
                    },
                    "3": {
                        "upvotes": 730,
                        "text": "Looks like 22 year low is not low enough, prices are still going up."
                    },
                    "4": {
                        "upvotes": 32,
                        "text": "I'm in a position where I NEED to buy a house by september ish.  What are my options right now, get fleeced?  Current housing situation is not stable so moving by September is pretty much a guarantee.\n\nRenting is technically possible, but nothing is available and a mortgage is cheaper."
                    },
                    "5": {
                        "upvotes": 23,
                        "text": "Fuck it. I'm just going to live in a van...down by the river."
                    }
                }
            },
            {
                "title": "Musk asks court to reject Twitter’s request for ‘warp speed’ trial",
                "text": "Related post on reddit: [**Twitter Says It Can Beat Musk’s Claims in Four Trial Days**](https://www.reddit.com/r/investing/comments/vyt06k/twitter_says_it_can_beat_musks_claims_in_four/)\n\n(Financial Times) -- Elon Musk says he needs more time to prepare for courtroom showdown over his attempt to back out of $44bn deal\n\nElon Musk has accused Twitter of an “unjustifiable request to rush” the trial to determine whether he should be forced to complete a $44bn deal to buy the social media company.\n\nMusk has suggested a trial start in February at the earliest, according to a court filing from his lawyers on Friday. That is several months later than the September timing being pushed for by Twitter in its lawsuit, which was filed in Delaware chancery court just days after Musk announced his intention to terminate the deal.\n\nLawyers representing the Tesla chief executive on Friday said in the 16-page response to Twitter’s lawsuit that the question of spam accounts on the network — one of the primary reasons Musk has given for attempting to back out of the deal — was “fundamental” to the case and required lengthier investigation and “substantial time for discovery”.\n\nMusk’s lawyers described the proposed trial date, and the suggestion by Twitter it could be completed in four days, as being on a “breakneck schedule”.\n\n“Twitter’s sudden request for warp speed after two months of foot-dragging and obfuscation is its latest tactic to shroud the truth about spam accounts long enough to railroad defendants into closing,” the filing read.\n\nA hearing on the matter is due to be held on Tuesday. Twitter declined to comment.\n\nThe social media company’s lawsuit accused Musk, the world’s richest man, of trying to back out of the deal on account of the rout in tech stocks that has hurt the value of Twitter and many of its peers. On July 8, when Musk announced his intention to back out of the deal worth $54.20 per share, the stock had fallen to $36.81.\n\nIn a case that has captivated the corporate world, Musk’s defence rests on his ability to convince the court that the issue of bots — automated spam accounts — on the platform is far greater than previously disclosed, representing a “material adverse effect” that would give him the ability to back out of the deal.\n\nMusk has alleged Twitter had breached the merger agreement by not sharing sufficient information on fake accounts, a position reiterated in Friday’s filing, which again questioned the company’s long-stated estimate that bots made up less than 5 per cent of users.\n\nFollowing a meeting between Musk and Twitter’s chief executive Parag Agrawal, “Musk was stunned to discover that Twitter’s process for identifying spam accounts relied on human reviewers to eyeball a minuscule portion of the userbase rather than utilising the company’s machine learning capabilities”, the filing said.\n\nIn its lawsuit, Twitter argued Musk had been well aware of the site’s issue with bots, pointing to tweets posted by Musk highlighting the matter prior to the deal.\n\nThe social network also accused Musk of breaching the terms of the merger agreement that demanded he not disparage the company, by highlighting his tweets that appeared to be goading Twitter’s leadership.\n\nAddressing that claim, Musk’s filing accused Twitter of being unable to take a joke.\n\n“With the sense of humor of a bot, Twitter claims that Musk is damaging the company with tweets like a Chuck Norris meme and a poop emoji,” the filing stated. “Twitter ignores that Musk is its second-largest shareholder with a far greater economic stake than the entire Twitter board.”\n\nVia: [https://www.ft.com/content/50691d5a-f454-4d96-803a-ac31bdf22805](https://www.ft.com/content/50691d5a-f454-4d96-803a-ac31bdf22805) (non-paywall: [https://archive.ph/YCCmP](https://archive.ph/YCCmP))",
                "date posted": "2022-07-16",
                "upvotes": 1527,
                "replies": {
                    "0": {
                        "upvotes": 82,
                        "text": "As somebody who is currently involved in a breach of contract lawsuit,\n\nThis is standard shit.  The people who want money want it done quickly, the people who stand to lose money want to drag it out forever.  They want the take the steam out of the plaintiffs.  Drag it out for 5 years until twitter says “fine we’ll just accept 1 billion in damages and leave him alone”\n\nDelay delay delay"
                    },
                    "1": {
                        "upvotes": 1051,
                        "text": "What is Musk going to learn by February that he doesn't already know now? He was the one who decided to nix the deal. Is he now claiming that he doesn't know why he did that?"
                    },
                    "2": {
                        "upvotes": 115,
                        "text": "[removed]"
                    },
                    "3": {
                        "upvotes": 422,
                        "text": "The acquisition date is set for late October, so it makes a lot of sense to have the trial completed before then to protect shareholders. \n\nHaving it in February is ridiculous. He's rich as fuck, he can hire more lawyers to comb through whatever data."
                    },
                    "4": {
                        "upvotes": 133,
                        "text": "“I don’t have enough information to make a decision on the matter, but I’ll offer 44 billion dollars for your company”\n\n“Y… you… you offer us 44 billions?… o… ok?”\n\n[elapsed time]\n\n“Sorry, I don’t have enough information to make a decision, bye.”\n\n“What?”"
                    },
                    "5": {
                        "upvotes": 443,
                        "text": "The extra time will allow Musk to create more spam bots to strengthen his claim about the bots"
                    }
                }
            }
        ]
    },
    "17": {
        "date_range": [
            "2022-07-22",
            "2022-07-29"
        ],
        "posts": [
            {
                "title": "GDP fell 0.9% in the second quarter, the second straight decline and a strong recession signal",
                "text": "The U.S. economy contracted for the second straight quarter from April to June, hitting a widely accepted rule of thumb for a recession, the Bureau of Economic Analysis reported Thursday.\n\nPressured by surging inflation, rising interest rates and intensifying supply chain pressures, gross domestic product fell 0.9% for the period, following a 1.6% decline in the first quarter. The Dow Jones estimate was for a gain of 0.3%.\n\nOfficially, the National Bureau of Economic Research declares recessions and expansions, and likely won’t make a judgment on the period in question for months if not longer.\n\nBut a second straight negative GDP reading meets a long-held basic view of recession, despite the unusual circumstances of the decline and regardless of what the NBER decides. GDP is the broadest measure of the economy and encompasses the total level of goods and services produced during the period.\n\nhttps://www.cnbc.com/2022/07/28/gdp-q2-.html",
                "date posted": "2022-07-28",
                "upvotes": 1936,
                "replies": {
                    "0": {
                        "upvotes": 1,
                        "text": "Some helpful reading for how a recession is defined: https://www.nber.org/research/business-cycle-dating\n\nAnd some helpful FAQs from the National Bureau of Economic Research: https://www.nber.org/business-cycle-dating-procedure-frequently-asked-questions\n\nSpecifically, their answer regarding two quarters of negative GDP:\n\n\nQ: The financial press often states the definition of a recession as two consecutive quarters of decline in real GDP. How does that relate to the NBER's recession dates?\n\nA: Most of the recessions identified by our procedures do consist of two or more consecutive quarters of declining real GDP, but not all of them. In 2001, for example, the recession did not include two consecutive quarters of decline in real GDP. In the recession from the peak in December 2007 to the trough in June 2009, real GDP declined in the first, third, and fourth quarters of 2008 and in the first and second quarters of 2009. Real GDI declined for the final three quarters of 2001 and for five of the six quarters in the 2007–2009 recession.\n\nQ: Why doesn't the committee accept the two-quarter definition?\n\nA: There are several reasons. First, we do not identify economic activity solely with real GDP, but consider a range of indicators. Second, we consider the depth of the decline in economic activity. The NBER definition includes the phrase, “a significant decline in economic activity.\" Thus real GDP could decline by relatively small amounts in two consecutive quarters without warranting the determination that a peak had occurred. Third, our main focus is on the monthly chronology, which requires consideration of monthly indicators. Fourth, in examining the behavior of production on a quarterly basis, where real GDP data are available, we give equal weight to real GDI. The difference between GDP and GDI—called the “statistical discrepancy”—was particularly important in the recessions of 2001 and 2007–2009."
                    },
                    "1": {
                        "upvotes": 853,
                        "text": "“This time is different” said every investor before making terrible decisions"
                    },
                    "2": {
                        "upvotes": 121,
                        "text": "[deleted]"
                    },
                    "3": {
                        "upvotes": 426,
                        "text": "Y'all know this is exactly how inflation control works, right? prices are too high, so Central bank increases rates, investing becomes expensive, economic activity slows down, demand quantity shrinks, then prices go down.\n\nIt's usually not this drastic because inflation usually dares to look sideways at the 3% mid-term average and the rate gets nudged, but we had +10% at one point so the rate adjustment was violent. From 0% to any number is a very big increase.\n\nJust relax, it'll pass, and in 10 years y'all be rich beyond your dreams. If you don't lose everything in this round, that is."
                    },
                    "4": {
                        "upvotes": 157,
                        "text": "Feels good because some of these bubbles like used cars, need to pop"
                    },
                    "5": {
                        "upvotes": 121,
                        "text": "I’m over 40 and been through multiple recessions, but what I’ve not been through is inflation being this high. So this recession, while painful, is much needed to curb inflation. Recessions are part of economic cycles but inflation running hot is not."
                    }
                }
            },
            {
                "title": "Federal Reserve hikes interest rates by 0.75 percentage point for second consecutive time to fight inflation",
                "text": " The Federal Reserve on Wednesday enacted its second consecutive 0.75 percentage point interest rate increase as it seeks to tamp down runaway inflation without creating a recession.  \n\n\nIn taking the benchmark overnight borrowing rate up to a range of 2.25%-2.5%, the moves in June and July represent the most stringent consecutive moves since the Fed began using the overnight funds rate as the principal tool of monetary policy in the early 1990s.  \n\n\nWhile the fed funds rate most directly impacts what banks charge each other for short-term loans, it feeds into a multitude of consumer products such as adjustable mortgages, auto loans and credit cards. The increase takes the funds rate to its highest level since December 2018. \n\n&#x200B;\n\n[https://www.cnbc.com/2022/07/27/fed-decision-july-2022-.html](https://www.cnbc.com/2022/07/27/fed-decision-july-2022-.html)",
                "date posted": "2022-07-27",
                "upvotes": 1901,
                "replies": {
                    "0": {
                        "upvotes": 735,
                        "text": "Have we ever had a such a wide spread between real inflation number and the Fed interest rate?   It still makes rational economic sense to borrow capital at current rates and let inflation eat into the principle,"
                    },
                    "1": {
                        "upvotes": 112,
                        "text": "Did they mention future guidance for rate hikes?"
                    },
                    "2": {
                        "upvotes": 335,
                        "text": "I've said it before, and now, i'll say it again. 2.5% interest rate is really not a lot.\n\nabove 5% it starts to get interesting"
                    },
                    "3": {
                        "upvotes": 124,
                        "text": "[deleted]"
                    },
                    "4": {
                        "upvotes": 34,
                        "text": "JPow said twice: “another unusually large increase could be appropriate in September”"
                    },
                    "5": {
                        "upvotes": 11,
                        "text": "2.5% interest rate is nowhere near high enough to materially impact a 9% inflation rate.\n\nIt’s not enough to alter the opportunity cost dynamic governing stock market and business investment either. Just for show."
                    }
                }
            },
            {
                "title": "Intel falls 10% after disappointing Q2 results: $0.29 EPS vs $0.70 expected. $15.3 billion in revenue vs $18 billion expected. CEO says third quarter is bottom",
                "text": "[Source 1](https://finance.yahoo.com/news/intel-intc-q2-earnings-revenues-212509924.html), [Source 2](https://d1io3yog0oux5.cloudfront.net/_c871574f7a6bcf254c9a016f657cf6a7/intel/db/887/8856/earnings_release/Q2+22_EarningsRelease+%281%29.pdf)\n\n* EPS: $.29 vs vs $.70 expected\n* Revenue: $15.3 billion vs. $18 billion expected\n\nMarket | Q2 2022 | Year over Year\n:--|:--:|--:\nClient Computing Group | $7.7 Billion | down 25%\nDatacenter and AI Group | $4.6 Billion | down 16%\nNetwork and Edge Group | $2.3 Billion | up 11%\nAccelerated Computing Systems and Graphics Group | $186 Million | up 5%\nMobileye | $460 Million | up 41%\nIntel Foundry Service | $122 Million | down 54%\n\n\n\nDetails:\n\n* Intel’s Client Computing and Datacenter and AI Groups were impacted by continued adverse market conditions; Network and Edge Group and Mobileye achieved record quarterly revenue.\n* Full-year revenue guidance was from from $68 billion to $65 billion; reiterating full-year adjusted free cash flow guidance.\n* Intel made significant progress during the quarter on the ramp of Intel 7 which is now shipping in aggregate over 35 million units. The company expects that Intel 4 will be ready for volume production in the second half of 2022 and is at or ahead of schedule for Intel 3, 20A and 18A.\n* IFS recently announced a strategic partnership with MediaTek to manufacture chips for smart edge devices using Intel process technologies. During the quarter, Intel also launched the IFS Cloud Alliance, the next phase of its accelerator ecosystem program that will enable secure design environments in the cloud.\n* In the second quarter, CCG launched the 12th generation Intel® Core™ HX processors, the final products in Intel’s Alder Lake family, which is now powering more than 525 designs.\n* In DCAI, Intel expanded its supply agreement with Meta, leveraging its IDM advantage so that Meta can meet its expanding compute needs. In the quarter, Intel agreed to expand its partnership with AWS to include the co-development of multi-generational data center solutions optimized for AWS infrastructure, and Intel as a strategic customer for internal workloads, including EDA. Intel expects these custom Intel® Xeon® solutions will bring greater levels of differentiation and a durable TCO advantage to AWS and its customers, including Intel. In addition, NVIDIA announced its selection of Sapphire Rapids for use in its new DGX-H100, which will couple Sapphire Rapids with NVIDIA's Hopper GPUs to deliver unprecedented AI performance.\n* NEX achieved record revenue and began shipping Mount Evans, a 200G ASIC IPU, which was codeveloped and is beginning to ramp with a large hyperscaler. In addition, the Intel® Xeon® D processor is ramping with leading companies across industries.\n* AXG shipped Intel’s first Intel® Blockscale ASIC, and the Intel® Arc A-series GPUs for laptops began shipping with OEMs, including Samsung, Lenovo, Acer, HP and Asus.\n* Mobileye achieved record revenue in the quarter with first half 2022 design wins generating 37 million units of projected future business.",
                "date posted": "2022-07-29",
                "upvotes": 1134,
                "replies": {
                    "0": {
                        "upvotes": 390,
                        "text": "I feel like Intel is a good example of falling asleep at the wheel. And a demonstration of a quote from NVidias CEO, something like, if you're not innovating, you're falling behind.\n\nI do think they have started to turn around, but it's late, and so now we have a lagging valuation, relative to what Intel is actually doing at present. Partly due to the nature of the industry. Intel could release of best in class CPU's, GPU's and other ASICs tonight, and it'll still take a year to generate genuine valuation change (besides pricing in positive speculation)."
                    },
                    "1": {
                        "upvotes": 83,
                        "text": "AMD now has a higher market cap 150B to 147B, has this ever happened before?"
                    },
                    "2": {
                        "upvotes": 183,
                        "text": "Their GAAP earnings are negative. Their BS earnings are positive. Stop using their made-up earnings number in the title and post.\n\nFrom your own source:\n\nSecond-quarter GAAP earnings per share (EPS) was $(0.11); non-GAAP EPS was $0.29."
                    },
                    "3": {
                        "upvotes": 42,
                        "text": "They're turning into IBM."
                    },
                    "4": {
                        "upvotes": 119,
                        "text": "Man.  When will it take for people to finally realize Intel is NOT a play for any growth of capital for the next 2-3 years AT LEAST.  \n\nYou have to understand the semi industry and know different companies engineering caliber and culture.  Intel is bottom at both.  Patty G is a positive choice for a CEO who could turn the ship around, but he has a long way to go to prove if he can turn it.\n\nThese last results were horrible.  Go listen to the earnings call.  Even the analysts asking questions had the tone of like \"how could you be THIS bad??\""
                    },
                    "5": {
                        "upvotes": 52,
                        "text": "Wonder how the CHIPS act will impact valuation.  I imagine it’s already priced in."
                    }
                }
            }
        ]
    },
    "18": {
        "date_range": [
            "2022-07-29",
            "2022-08-05"
        ],
        "posts": [
            {
                "title": "Uber turns cash flow positive for the first time, shares surge",
                "text": "[https://www.reuters.com/business/autos-transportation/uber-turns-cash-flow-positive-first-time-2022-08-02/](https://www.reuters.com/business/autos-transportation/uber-turns-cash-flow-positive-first-time-2022-08-02/)\n\n Aug 2 (Reuters) - Uber Technologies Inc [**(UBER.N)**](https://www.reuters.com/companies/UBER.N) on Tuesday reported positive quarterly cash flow for the first time ever and forecast third-quarter operating profit above estimates, betting on steady demand for its ride-hailing and food-delivery services.\n\nUber shares, which have lost more than 40% this year, surged 15% to $28.41 in premarket trading and helped drive an 8% gain in rival Lyft Inc's shares.\n\nUber generated free cash flow of $382 million in the second quarter, topping analysts' expectations of $263.2 million, as trips exceeded pre-pandemic levels, boosted by the reopening of offices and a surge in travel demand.",
                "date posted": "2022-08-02",
                "upvotes": 1739,
                "replies": {
                    "0": {
                        "upvotes": 755,
                        "text": "Their prices are getting ridiculous too.  \n\nWe will see how long people put up with it."
                    },
                    "1": {
                        "upvotes": 39,
                        "text": "Yeah I was all for using Uber to the airport to LAX but rides costing like $40-80 from DTLA. Now I just pay $10 for the bus directly to the airport from the flyaway"
                    },
                    "2": {
                        "upvotes": 721,
                        "text": "And still losing $2.8B in the quarter."
                    },
                    "3": {
                        "upvotes": 14,
                        "text": "My Uber to LaGuardia cost more than my spirit flight to Fort Lauderdale"
                    },
                    "4": {
                        "upvotes": 165,
                        "text": "The lack of ability and desire for most people here to actually read the quarterly results instead of cherry picking numbers out of an article is sad.\n\n* \"You totally ignored the part about their net income.\" \"And still losing $2.8B in the quarter.\"\n\n95% of that is due to write downs against investments. Did those investments (currently) work out? No, clearly not, but it has zero to do with cashflow or core operating income. \n\n* \"When net income and cash flow are severely disparate, something is wrong.\"\n\nYes, probably! But isn't that more of a reason to actually ask 'why'? \n\nDoes anyone actually care why the stock is up on this news or do we only want to write pithy remarks to support a sardonic narrative?"
                    },
                    "5": {
                        "upvotes": 10,
                        "text": "That’s probably because they cut the pay for Uber eats orders by more than 50% just in the last few months. That money is coming out of my pocket"
                    }
                }
            },
            {
                "title": "Robinhood announces plan to cut 23% of staff",
                "text": "https://blog.robinhood.com/news/2022/8/2/a-message-from-our-ceo-and-co-founder-vlad-tenev\n\nAugust 2, 2022\n\n>As part of a broader company reorganization into a General Manager (GM) structure, I just announced that we are reducing our headcount by approximately 23%. While employees from all functions will be impacted, the changes are particularly concentrated in our operations, marketing, and program management functions.\n\nThis comes after a previous 9% reduction in headcount earlier in 2022.",
                "date posted": "2022-08-02",
                "upvotes": 1439,
                "replies": {
                    "0": {
                        "upvotes": 762,
                        "text": "Use Robinhood to open puts on Robinhood"
                    },
                    "1": {
                        "upvotes": 232,
                        "text": "I imagine they worded it along the lines of *\"You can continue logging in and working, you just cannot be paid for it any longer.\"*"
                    },
                    "2": {
                        "upvotes": 46,
                        "text": "Jokes aside - for anyone interested in either a long/short position in $HOOD, the 8-k filing with more details is here - [https://www.sec.gov/ix?doc=/Archives/edgar/data/0001783879/000178387922000162/hood-20220729.htm](https://www.sec.gov/ix?doc=/Archives/edgar/data/0001783879/000178387922000162/hood-20220729.htm)\n\nInteresting to note that the Chief Product Officer is also impacted."
                    },
                    "3": {
                        "upvotes": 133,
                        "text": "Oh no the one guy on risk assessment is going part time."
                    },
                    "4": {
                        "upvotes": 192,
                        "text": "How long before they announce a name change to **Sheriff of Nottingham**?"
                    },
                    "5": {
                        "upvotes": 204,
                        "text": "Seems like if you’re known for shit operations already maybe this ain’t a place I’d cut jobs from?"
                    }
                }
            },
            {
                "title": "Payrolls increased 528,000 in July, much better than expected in a sign of strength for jobs market",
                "text": "[https://www.cnbc.com/2022/08/05/jobs-report-july-2022-528000.html](https://www.cnbc.com/2022/08/05/jobs-report-july-2022-528000.html)\n\n&#x200B;\n\nHiring in July was far better than expected, defying signs that the  economic recovery is losing steam, the Bureau of Labor Statistics  reported Friday.\n\nNonfarm payrolls rose 528,000 for the month and  the unemployment rate was 3.5%, easily topping the Dow Jones estimates  of 258,000 and 3.6% respectively.\n\nWage  growth also surged higher, as average earning earnings jumped 0.5% for  the month and 5.2% from the same time a year ago. Those numbers add fuel  to an inflation picture that already has consumer prices rising at  their fastest rate since the early 1980s. ",
                "date posted": "2022-08-05",
                "upvotes": 1224,
                "replies": {
                    "0": {
                        "upvotes": 468,
                        "text": "528k vs 258k is a hell of an overperformance. The fact that June was revised up by another 26k is also a pretty strong sign for the labor market right now."
                    },
                    "1": {
                        "upvotes": 222,
                        "text": "Most of the people on Reddit are so focused on FAANG stocks that they don’t realize what’s happening in the broader industrial market.  We are seeing a MASSIVE shift of production from China back to the US."
                    },
                    "2": {
                        "upvotes": 113,
                        "text": "Sounds like we’re moving full steam ahead on Federal interest rate increases. In good news, to match the anticipated future rate hikes, I suppose that SoFi will be paying 3%+ on its checking account by the end of the year."
                    },
                    "3": {
                        "upvotes": 259,
                        "text": "More evidence that you should always take with a huge grain of salt the tech-centered, sky-is-falling economic views here on Reddit."
                    },
                    "4": {
                        "upvotes": 82,
                        "text": "So basically when the data starts to show inflation is coming down, it's going to be one helluva bull run."
                    },
                    "5": {
                        "upvotes": 6,
                        "text": "Sweet! Feels good to be 1 in that 528,000.\n\nNow to get past training…"
                    }
                }
            },
            {
                "title": "Mysteriously Received 1/4 Million worth of stocks in my account?",
                "text": "So I woke up this morning, drinking coffee, look at my etrade account, spit out my coffee. Somehow my account value increased by more than a factor of 10 overnight (cuz I was lookin at it yesterday). Upon closer inspection I noticed I had a fuckload of SPY shares. There is nothing in my transaction history to reflect this besides a couple shares I bought back in May.\n\nWTF is going on? \n\nA) Is this a fluke?   \nB) If so will this just be corrected on monday?   \nC) If not corrected, do I have to report this, or would I be getting myself in trouble if i just sold that on monday?  \nD) Did some secret wealthy friend of mine just gift me this? I feel like such a thing would still be reflected on my transaction history.\n\nThanks",
                "date posted": "2022-07-30",
                "upvotes": 1019,
                "replies": {
                    "0": {
                        "upvotes": 2257,
                        "text": "Call customer service. If you did get a gift from a mysterious benefactor, it would appear in your account history as something like \"ACATS Transfer\" or \"Journal Shares\". If it's some sort of mistake, it will be corrected; bank errors in your favor only happen in board games."
                    },
                    "1": {
                        "upvotes": 950,
                        "text": "It's a dividend reinvestment issue. E Trade screwed the pooch on how they accounted for it. \n\nThey're working on it.\n\nSource: the E Trade help line has it as an announcement when you dial in."
                    },
                    "2": {
                        "upvotes": 292,
                        "text": "e-trade often shows errors like this. Wait for the market to be open Monday morning, check again. If it's still wrong, call them. Don't touch the shares until it's cleared up."
                    },
                    "3": {
                        "upvotes": 26,
                        "text": "A while back something unsimilar happened to us.  Our bank account was 44k on the red because someone else cashed a check and the bank mistakenly charged our account. It was easy to fix. \n\nMost likely that amount was deposited in your account by error and it will be noticed by the real owner."
                    },
                    "4": {
                        "upvotes": 23,
                        "text": "One time in early 2000s when etrade 1st came out and i was just dabbling my account went from $1k to $38m.  I thought i was a genius. Nope error.  Gone the next day."
                    },
                    "5": {
                        "upvotes": 42,
                        "text": "Don’t touch it.  Ignore for a week.  If it isn’t fixed by then, call support."
                    }
                }
            }
        ]
    },
    "19": {
        "date_range": [
            "2022-08-05",
            "2022-08-12"
        ],
        "posts": [
            {
                "title": "Seasonally adjusted job numbers looked good because of +384k part-time workers, but full time workers declined for the second month in a row.",
                "text": "The headline on Friday was that job numbers went up +528,000... but seasonally adjusted, the actual break down was:\n\n* Full Time -71,000\n* Part Time +384,000\n* Multiple Jobs +92,000\n\nUnemployment rate slipped to 3.5 from 3.6, but labor force participation rate also moved down slightly from 62.1% from 62.2%. That implies some of that drop is from people dropping out of the unemployment calculation. Discouraged workers were up to 424k in July vs 364k in June.\n\nThis is also the second month in a row that seasonally adjusted full time workers have declined. Before this month's decline, they declined -152,000 in June.\n\n[Source for the above: BLS](https://www.bls.gov/news.release/pdf/empsit.pdf)\n\nThe % of the population employed has actually been decreasing [since March](https://www.peoplespolicyproject.org/wp-content/uploads/2022/08/Percent-of-the-Entire-Population-That-Is-Employed-4.svg).\n\nYou can also read about it in this [CNBC](https://www.cnbc.com/2022/08/05/july-jobs-report-shows-more-americans-working-part-time.html) article, which says of the increase in part-time workers, \"Involuntary part-time workers,” those in part-time positions for economic reasons, increased by a seasonally adjusted 303,000 in July.\" \n\n---\n\nAdding to that, on Friday the Federal Reserve announced consumer borrowing rose 10.5% in June, after rising 6.3% in May. Revolving debt was up 16% m/m. In total, non-housing related debt grew in the second quarter by the most since 2016. [Source: CNN](https://www.cnn.com/2022/08/05/economy/june-consumer-credit-report-debt-increase/index.html). \n\nAmericans opened 233 million credit card accounts in the second quarter, the most since 2008 according to the NY Fed [Source: CNN](https://www.cnn.com/2022/08/02/economy/consumer-credit-borrowing-surge/index.html). \n\n\n\n---\n\nPoliticians and the top post on the sub seem excited but these numbers just don't look bullish to me unless you're looking for a part-time job in hospitality. \n\nIf the fed takes the headline numbers as license to raise rates even faster, we probably see more businesses laying full-time workers off.\n\n---\n\n**The top comment right now is asking about why the numbers don't add up to 528 so I'm adding that context here.** First, here's screenshots of CNBC [screenshot](https://imgur.com/oO7Elqd) and the [source article link](https://www.cnbc.com/2022/08/05/july-jobs-report-shows-more-americans-working-part-time.html) and the [BLS site](https://pbs.twimg.com/media/FZaMiRFWIAEZE73?format=jpg&name=large) to back up the original numbers. \n\nThey were all sourced before but screenshots because redditors don't like clicking links.\n\nAnyway, the +528 is seasonally adjusted but it is from the Establishment Survey (pages 6-7 of the [Bureau of Labor Services monthly Employment Situation report](https://www.bls.gov/news.release/pdf/empsit.pdf)). Only the Household Survey data reports the breakdown between part-time and full-time is only reported in the Household Survey pages (pages 13-41). The Household Survey is how we determine the national unemployment rate and the labor force participation rate among other stats.\n\nThere is a different sample population (Household is bigger N, Establishment is smaller) and some differences between how people are counted in each survey. For example, if someone works multiple jobs they appear multiple times in Establishment but only once in Household. If someone is self-employed they appear in Household but not Establishment. Household counts self-employed but total Total Nonfarm Payroll was 152,536k for Establishment and employed Civilian labor force was 158,290k for Household.\n\nSo the numbers are a little off because the data sets are different even though both are published in the same report by the BLS.",
                "date posted": "2022-08-06",
                "upvotes": 1748,
                "replies": {
                    "0": {
                        "upvotes": 187,
                        "text": "I just woke up so forgive me if this is a dumb question...why don't those 3 numbers tie to the overall 528k number?\n\nYou've only accounted for 405k of the jobs. Where are the other 123k? Is this the \"seasonal\" adjustment?"
                    },
                    "1": {
                        "upvotes": 493,
                        "text": "All of these represent moves of a tiny percentage of the labor force. There are 163m people involved. Trying to deduce anything from 92,000 more people working multiple jobs (0.056% of the labor force) or more part time and less full time jobs is futile when the moves are this small."
                    },
                    "2": {
                        "upvotes": 6,
                        "text": "The household population survey showed basically flat job growth since March. However, this is because some self-employed have now joined back into corporations for likely higher paying jobs. \n\nIn reality, our labor force is basically flat since COVID-19."
                    },
                    "3": {
                        "upvotes": 114,
                        "text": "Retirees and stay-at-home parents being forced to take a job to keep up with artificial price hikes."
                    },
                    "4": {
                        "upvotes": 5,
                        "text": "People moving into flexible roles? Pandemic babies? Large amounts of particularly young mothers keeping their roles but moving into part time positions in my company. Are there stats on sector for those part time roles?"
                    },
                    "5": {
                        "upvotes": 5,
                        "text": "Ya, here in Canada our job numbers came out way lower then expected. I think we expected a 15,000 addition, where in actuality we got a 37,000 *decline* ..or somewhere around there"
                    }
                }
            },
            {
                "title": "Inflation was 8.5% year-over-year in July, below expectations of 8.7%",
                "text": "The [CPI](https://www.bls.gov/news.release/cpi.nr0.htm) is out and shows inflation slowing. The increase was 0% month-over-month, and 8.5% year over year. June had shown 9.1% year-over-year. The gasoline price index is down 7.7%.  \n     \nWhile the move downwards is small, it does signal inflation is cooling.",
                "date posted": "2022-08-10",
                "upvotes": 1639,
                "replies": {
                    "0": {
                        "upvotes": 583,
                        "text": "0.0% MoM. That’s even lower than the less hot than expected expectations of 0.14% MoM."
                    },
                    "1": {
                        "upvotes": 225,
                        "text": "I would love to show myself 4 years ago this headline"
                    },
                    "2": {
                        "upvotes": 768,
                        "text": "Don’t get me wrong, I’m glad it’s showing a peak and trending the right way from a relative perspective. But yeah, from an absolute perspective, it’s wild we and the market are relieved and feeling good about, eg, 8.5% YoY inflation."
                    },
                    "3": {
                        "upvotes": 129,
                        "text": "Moving in the right direction.   Hopefully next qtr gets better. Gasoline price has a predominant impact. Transportation is a major part. If gasoline cost is down the rest commodities will be lower."
                    },
                    "4": {
                        "upvotes": 148,
                        "text": "Wow this comment section is a mess."
                    },
                    "5": {
                        "upvotes": 33,
                        "text": "Solid report overall.  Few highlights:\n\n - Energy prices are obviously dominating the headline number.\n - Core CPI MoM dropped to 0.3%\n - Food prices still remained stubbornly high\n - Goods inflation largely cooled but in a mixed fashion, but vehicles, transportation and medical goods remained a bit elevated and many other goods actually dropping in price.  Perhaps the first confirmation of excess inventory and discounting that we had been hearing about from large retailers.\n - Shelter costs increased at the same rate, while an improvement from the accelerating rate of appreciation we've seen this is still contributing a significant amount to core inflation and something that needs to come down further.\n - Public transportation was largely responsible for keeping the MoM services number down, but also a significant contributor to the higher growth rate in services over recent months.  This is also essentially a pass through for energy costs and vehicle costs on the services side.\n\nPretty solid print overall.  Energy prices dropped and that has pretty significant impacts across the economy.  Hopefully that'll feed into lower food prices a bit going forward.  Housing costs still need to slow down and I know annecdotally it does seem like that's been happening around my area just based on where home prices have gone recently and with mortgage rates off the recent June highs.  Mortgage rates will probably creep back up north of 5% this week but not by much.\n\nWe've got another print to look forward to before the FOMC's next meeting ultimately here and I'm sure there's going to be plenty of commentary incoming from FOMC members to see if this has tilted rate hike expectations at all over the coming days/weeks."
                    }
                }
            }
        ]
    },
    "20": {
        "date_range": [
            "2022-08-12",
            "2022-08-19"
        ],
        "posts": []
    },
    "21": {
        "date_range": [
            "2022-08-19",
            "2022-08-27"
        ],
        "posts": []
    },
    "22": {
        "date_range": [
            "2022-08-27",
            "2022-09-03"
        ],
        "posts": [
            {
                "title": "NewYorkTimes: To Make Money in the Stock Market, Do Nothing",
                "text": "https://www.nytimes.com/2022/08/26/business/stock-market-bear-nothing.html\n\nBack to basics\n\nWhen the market drops, as it did early this year, it paid not to panic. If you had sold during the decline you would have missed the substantial gains of June, July and August. It was much easier to have remained calm while losing money in the stock market.\n\nIf you set things up right, your investing will require that you do nothing further except, perhaps, rebalance your holdings every so often to make sure you have the proportion of stocks and bonds that you really want.",
                "date posted": "2022-08-28",
                "upvotes": 1110,
                "replies": {
                    "0": {
                        "upvotes": 905,
                        "text": "I remember reading an article saying the most successful investors were dead people. No buys, no sells, just dividends and staying the course lol."
                    },
                    "1": {
                        "upvotes": 260,
                        "text": "As the late Bogle said “Don’t do something, just stand there.”"
                    },
                    "2": {
                        "upvotes": 29,
                        "text": "The only people who get hurt on a roller coaster are the ones who jump off."
                    },
                    "3": {
                        "upvotes": 174,
                        "text": "There are so many people on reddit who can't tell they are gambling. Listening to people here talk trades is like listening to people talk about their horoscopes or their palm readings. It's really kind of sad to see."
                    },
                    "4": {
                        "upvotes": 13,
                        "text": "They just have to recycle the same 20 topics every year and call it a job."
                    },
                    "5": {
                        "upvotes": 177,
                        "text": "“Time in the market beats timing the market.”\n\nBut for some, where’s the fun in that?"
                    }
                }
            }
        ]
    },
    "23": {
        "date_range": [
            "2022-09-03",
            "2022-09-10"
        ],
        "posts": [
            {
                "title": "Porsche IPO is so corrupt that if it goes through, I’m never investing into German stocks again",
                "text": "**TLDR**: the Porsche family is getting full control of Porsche the company literally for free. This is the main reason for the IPO. The way the IPO is structured will hurt VW and gullible investors buying into this. VW and its long-term strategy are thrown into disarray.\n\n**TLDR (with light details):**\n\n1. The Porsche family already owns a significant chunk of both VW and Porsche companies. But they want full control of the Porsche company.\n2. They ousted the CEO of VW on a pretext and forced the IPO that benefits only them.\n3. The family will get additional 25% of the Porsche, which will give them full control of the company.\n4. The family is not paying a market price for 25% stake. In fact, they are not paying at all, because they forced VW to pay a dividend from the IPO proceeds, which the family will get by being a shareholder of VW.\n5. Shares available to the public during the IPO are all non-voting.\n\n**Long story**\n\nThe way the IPO is organized is a disgrace, and if the German government allows it to go through as is, I will have no faith in making long-term investments in German stocks anymore.\n\nIf this is legal under German laws, then I'm not buying. If this is illegal and they don't do anything, I'm not buying either.\n\nTo understand what and why is happening you need a little context, so here it is.\n\nThe Porsche family lost control of the Porsche company during the 2008 financial crisis. They wanted to buy VW but ended up in a weird financial situation where they instead had to give up control of Porsche to VW but got a controlling voting stake in VW.\n\nThe ownership structure is complicated, but in a simplified form it looks like this:\n\n>The family -> Porsche Holdings -> VW company -> Porsche company\n\nThe IPO will make it look like this:\n\n>The family -> Porsche Holdings -> VW company (>50% of voting rights)  \n>  \n>The family -> Porsche Holdings -> Porsche Company (>50% of voting rights)\n\nThe money flow is like this:\n\n>The family “buys” 25% of voting shares from VW below market price with no competition.  \n>  \n>VW pays 50% of IPO proceeds as dividends.  \n>  \n>The family gets its money back from VW in the form of dividends.\n\nThis IPO would be a disaster even during normal times. VW is losing its best cash cow, for half the price, and the price is below market rate. But it’s happening during one of the worst times for IPOs ever. The stocks are in a global downturn, hammered by inflation, rising rates, quantitative tightening, supply chain issues, and ongoing war in Ukraine, which amplified all of the above and added energy crisis on top of that. Germany is in the worst economic situation since the fall of the Berlin wall.\n\nThis is not the right time to IPO a luxurious brand. However, this is the best time for the family to get their favorite asset out of VW. From their perspective, the less money IPO makes, the better. This conflict of interests is as bad as it gets.\n\nIPO shares available to the public will be useless non-voting shares for gullible investors, who do not understand what they are buying. Think SNAP or GOOG. But it gets worse.\n\nLet’s remember for a moment, that VW was not a good company for a long while. It ended up in a “diesel gate” scandal, had to pay enormous fines, as well as to change its CEO. This turned out to be a blessing in disguise, because VW got a good new CEO, had to reinvent itself by becoming more environmentally friendly, and thus started an early transition into EVs.\n\nVW is already a top seller of EVs in Europe and rapidly growing its market share. It has a vast portfolio of cars ranging all segments, from the cheapest economy cars to the most luxurious ones, of which Porsche is the main brand. Platforms within VW are interchangeable, they use the same tech across multiple brands to achieve synergy.\n\nNow, if you take Porsche out, these plans are thrown into disarray. On top of that, both Porsche and VW will have the same CEO, answering to the same family. Which company do you think he will prioritize more when it comes to that?\n\nWhat’s more, the transition to EVs was not going smooth already. There are issues with software, which VW was never good at historically. And the labor unions were very unhappy at the potential loss of jobs (because you need less jobs to make EVs). The family seized on this opportunity to oust the CEO under a pretext that the software was delayed, and the labor unions supported the change to get their job guarantees.\n\nThe labor unions now expect to keep their jobs, meaning VW will have to keep combustion engine factories operating for longer for no economical reason. This is good for workers, but a disaster for investors in VW. The family got their IPO, which is good for them, but also a disaster for investors. And the new CEO has no experience in building software whatsoever with no sound plans to address the problems.\n\nThe right change for VW would be to hire an experienced executive VP from one of the major tech companies in the US and improve their software development culture. There was no need to change their CEO, especially considering that VW was transitioning to EVs better than all of its competitors. But, oh well.\n\n**My positions:**\n\nI owned VW stock for a while and sold at \\~2x profit after the war in Ukraine started but was planning to buy back later. Now, however, if the IPO goes through, I’m not touching this stock, or any other German stocks for that matter.",
                "date posted": "2022-09-07",
                "upvotes": 2353,
                "replies": {
                    "0": {
                        "upvotes": 167,
                        "text": "Wait, this is not how it‘s been reported on. Porsche SE (holding) controls 53.3% or current VW voting rights and 31.4% stocks [so they have indirect control of Porsche AG (company) through VW].\n\nThe plan is to get 25%+1 (voting stock) of the Porsche AG after IPO for veto rights. VW will retain 75%-1 (voting stock) of Porsche AG. Up to 25% of nonvoting stock is up for grabs in the IPO.\n\nsource (in German): https://www.tagesschau.de/wirtschaft/unternehmen/porsche-ag-boersengang-faq-101.html"
                    },
                    "1": {
                        "upvotes": 467,
                        "text": "Thanks for the writeup. I had no idea about any of this, but I did find it strange that Porsche would IPO during such a terrible market, so there must have been something going on behind the scenes. Definitely smelled like shit, and was not putting any funds in."
                    },
                    "2": {
                        "upvotes": 782,
                        "text": "For those that are confused\n\nPorsche AG -> makes cars owned by WV\n\nPorsche SE -> holding company, that owns significant chunk of WV\n\n&#x200B;\n\ntl;dr; Porsche family will have all voting rights with common shares, but with preferred shares going to the public they get paid first in case of bankruptcy (like that will ever happen). So you get no say in how the business is ran"
                    },
                    "3": {
                        "upvotes": 227,
                        "text": "It's all way more complicated than that. VW likely made that deal to help the transition to EVs. They not only plan to make 10 billion € with this IPO, it's also probable that the two founding families Porsche and Piëch will support the EV transition in return for control of Porsche.\n\nThe ousted CEO Herbert Diess ran into a lot of resistance with his ambitious plans to transform the company as there are many interests involved.\n\nThere are the influential and powerful founding families, the German state of Niedersachsen (lower saxony) which above all wants to retain jobs, the \"Betriebsrat\" (an organisation managing the rights and interests of VW's employees) and lastly the \"IG Metall\", one of Germany's last large and powerful unions.\n\nMost of these players are unhappy about the probable loss of jobs if VW transitions to electric vehicles and software. EV production can be highly automated and what VW really needs to do is to get rid of thousands of old economy employees and hire a bunch of software developers instead.\n\nThe union, the Betriebsrat and the state of lower saxony say that while the transition must happen, not a single job/employee must be left behind in the process which isn't realistic.\n\nThe interests of the two families are obscure, but their support - which basically will be bought with Porsche - removes at least one of the many walls of resistance.\n\nSo I guess the IPO is necessary, though I agree that the timing couldn't be worse. I also agree that retail investors should stay away from it and see how it pans out."
                    },
                    "4": {
                        "upvotes": 22,
                        "text": "Thanks for the write up. I understand that they are “buying” control but will be repaid later via dividends from the income generated by the IPO. How come they are paying below market price for it initially? Also, why can’t regular investors purchase the 25% common stock from VW?"
                    },
                    "5": {
                        "upvotes": 59,
                        "text": "Porsche SE pays VW x€ for the Porsche AG shares. Half of the IPO proceeds, i.e. 0.5 * x€, is paid as dividends. Porsche SE owns preferred shares of VW, so their voting power is 53.3%, but subscribed capital and their share of dividends is only 31.4%.\n\n0.314 * 0.5 * x€ = 0.157x€.\n\nThey’re not getting ”their money back as dividends”. They’re getting back fifteen cents for every euro they pay to VW for Porsche AG. The only thing to criticize here could be the price they’re paying, not the amount of money they’re getting back as dividends."
                    }
                }
            },
            {
                "title": "I collect coins and banknotes as a hobby. Here is why buying money with the a picture of Queen Elizabeth II on it thinking these are going to become collectables is a bad investment idea",
                "text": "Over the next week or so there is going to be a wave of people passing through here with the 'unique' idea that they are going to buy some British banknotes or coins and that in just a short time its going to be a higly sought after collectable. It wont. This is a bad investment idea. Now naturally the kind of person who comes up with this get-rich-quick scheme is going to try anyway, but for the rest of us I will try and explain here why this is a bad idea.\n\nFirst, let me clarify the difference between currency value and collectable value. If I get a five quid note and I pay five quid to get it, this does not mean it is a collectable. That is just how money works. For something to be collectable it has to have a value above and beyond what you would be able to use it as if you just spent it as cash. To extend this just a tiny bit more, if I got an ultra rare limited edition five quid note that is in mint condition and I pay a million quid for it, the actual colectable value is nine hundred ninty nine thousand nine hundred ninty five quid.\n\nThe next thing I need to explain is marginal value. Lets say a store was selling apples. What would be the better sale price? Half off? Or buy one get one free? At first thought this seems total nonsense. Thats the same thing! But not so fast. What if I was selling toothbrushes? Do I realy need two toothbrushes? If I got a second toothbrush, one of those is just going to be kept under the sink untill the first toothbrush wears out. I would rather just get one toothbrush only and get it for half off. This is marginal utility.\n\nSo with both of these idea in mind, lets talk about coin collecting. Say someone wants to start collecting and the first thing they try is getting all five of the \"five good emperors\". They go to a few swap meats and quickly start acquiring the set. But  Nerva  is giving them some problems. No matter where they go, they cant seem to find a  Nerva. But they keep at it and soon enough they find one for sale but its $200. Ouch! Thats above their price point for just a starting collection, but they realy want to have the whole set. So they break down and pay it. A few more months roll by and they once again find someone selling a  Nerva  and selling it for $199. I this was absolutely any other product it would be natural to think they would buy this second one also. But what about the collectable value? What about the marginal utility? Do they honestly need a second copy of the  Emperor  Nerva  coin? The series is already complete so what's the point of having it in your collection twice? Who cares if its a buck cheaper. They wouldn't even buy it to try and \"flip\" to another collector. The time and effort they would need to go to in order to flip it would bot be worth making just $1 in profit.\n\nAnd that leads us finally to Queen Elizabeth II. Coins and banknotes with her likeness are not rare to begin with. Supply already way outstrips demand. But even on the demand side, collectables do not follow the regular supply-and-demand curve. Every economic textbook out there shows this graph as a smooth gently curving function. But the supply-and-demand for collectables doesn't do that. There is a hard upper limit that is the total number of people that are collectors. If the number of coins is less than the number of collectors, there will be demand. But if the number of coins is more than the number of people that are into the hobby, you do not get a slow gradual tapering off. You get a graph that drops off a cliff.\n\nThere are ancient roman coins out there that you can get even today that are just the value of the metal the coin is minted from. The collectable value that is above and buying the value of the base metal is basically zero. This is true despite the emperor depicted on the coin being dead for thousands of years. The reason they have no collectable value is ttoaly decoupled from the emperor being alive or dead. The lack of collectable value comes from the fact that the number of coins in existence is larger than the number of people in the hobby. There is enough to give all collectors at least one, and nobody cares about having a second one.\n\nCoins and Banknotes with Queen Elizabeth II will never have a collectable value. Dont even try to buy them up now with the hope that in the future you can sell them for more. It wont happen. It cant happen. Don't even try. If you want to use this event as motivation to get into coin collecting as a hobby them have at it! Its a great pastime and I will welcome you. But if your just out to flip coins as a get rich quick scheme, then dont.\n\n\"You know Jerry, I'm not gonna tell you that this coin will increase in value, or even hold its current value. The truth is, you brought it cuz you like it. It has value to you. That's what matters\"",
                "date posted": "2022-09-08",
                "upvotes": 1544,
                "replies": {
                    "0": {
                        "upvotes": 704,
                        "text": "There's a good 8 decades or so with her likeness on coins. Even the early gold sovereigns don't command more than 10-15% over spot at retail."
                    },
                    "1": {
                        "upvotes": 388,
                        "text": "Nice try. Clearly you’re trying to get us to not buy so you can swoop in and clean house. Not today just friend, not today."
                    },
                    "2": {
                        "upvotes": 63,
                        "text": "These ancient roman coins you speak of... not as an investment (haha), but I would find that very cool. Where would I find these not expensive cool coins?"
                    },
                    "3": {
                        "upvotes": 173,
                        "text": "If it takes so much text to explain such a basic idea… these people would not read it anyway :)"
                    },
                    "4": {
                        "upvotes": 45,
                        "text": "Who would think it was a good idea? She's on billions of pieces of money."
                    },
                    "5": {
                        "upvotes": 25,
                        "text": "It's similar in sports' cards (my collectible poison of choice). Need to have a very good understanding of supply and demand for the particular collectible in order to better understand value proposition and risks. Also, one of the worst times to buy an athletes' collectibles  is when they die."
                    }
                }
            }
        ]
    },
    "24": {
        "date_range": [
            "2022-09-10",
            "2022-09-17"
        ],
        "posts": [
            {
                "title": "Former financial adviser had me move my 401K ($560,000.00) into cash. With the market downturns should I leave the money in cash or is now a good time to get back in?",
                "text": "63yo male in Indiana.  Former financial adviser had me move my 401K ($560,000.00) to cash.  What type of funds should I move it to or should I just leave it in cash for now due to the volatility in the market?  I plan on retiring next year.\n\nI was originally going to put $500K in an annuity but decided against it.   So\nall my funds are just sitting in cash. \n\nI'm worried if I go back in the market right now I could lose a big chunk of money.\n\nAny advice would be appreciated!",
                "date posted": "2022-09-16",
                "upvotes": 1073,
                "replies": {
                    "0": {
                        "upvotes": 722,
                        "text": "What made him become your  “former” financial advisor"
                    },
                    "1": {
                        "upvotes": 465,
                        "text": "Not enough information for anyone here to help you. When you are thinking of retiring? What other assets do you have on the side that can produce interest/dividend payments? How much do you need to live off of in a year?"
                    },
                    "2": {
                        "upvotes": 205,
                        "text": "You can get 4% in short term treasuries so I’d start putting some into those type of holdings. Being so close to retirement, this would be the safest option. You also may want to consider dollar cost averaging a position in the s&p 500 for the money you’ll need in 7+ years."
                    },
                    "3": {
                        "upvotes": 283,
                        "text": "If you are retiring next year, i would not go back like that. \nInvesting is a long game. Think how you want to enjoy your money, put some into guaranteed returns or even a penson plan. \nHave fun!"
                    },
                    "4": {
                        "upvotes": 109,
                        "text": "Obviously it worked out for you (depending on when you pulled it, I guess). A larger bond portion might be in your future, as yields get higher. Go get your 10k in IBonds, for starters."
                    },
                    "5": {
                        "upvotes": 811,
                        "text": "Your financial advisor > random Reddit opinions\n\nEdit: omg, it’s a joke about the “time in > timing” comments. My opinion is also, obviously, that of a random redditor as well."
                    }
                }
            },
            {
                "title": "World Bank warns higher rates risk causing global recession",
                "text": "(Financial Times) -- Organisation calls on central banks to co-ordinate policies and tighten less to avoid ‘devastating’ worldwide downturn\n\nThe World Bank has warned that leading central banks risk sending the global economy into a “devastating” recession next year if policymakers raise interest rates too high over the months ahead and stress financial markets.\n\nThe Washington-based organisation called on monetary authorities in the big economies to co-ordinate their actions to reduce the overall amount of tightening.\n\nCentral banks, led by the US Federal Reserve, have embarked on a series of aggressive rate rises over the course of 2022 in a bid to tame inflation that is at, or close to, double figures in several advanced economies for the first time in decades.\n\nEnergy and food prices have surged following Russia’s invasion of Ukraine in late February, triggering a cost of living crisis.\n\nTo avoid letting inflation rip, the World Bank urged governments to provide targeted relief to vulnerable households instead of relying on tighter monetary policy.\n\nDavid Malpass, president of the World Bank, said momentum in the global economy was sliding and more countries were already falling into recession. “My deep concern is that these trends will persist, with long-lasting consequences that are devastating for people in emerging market and developing economies,” he added.\n\nHe called for more action to boost production to ease inflationary pressure, rather than all the focus being on curbing spending. Increased investment would, he said, “improve productivity and capital allocation, which are critical for growth and poverty reduction”.\n\nThe World Bank did not produce new forecasts for the global economy, but noted that the outlook for 2023 had been sliding as rich and poor countries alike responded to high inflation this year by seeking to limit spending.\n\n“Central banks around the world have been raising interest rates this year with a degree of synchronicity not seen over the past five decades — a trend that is likely to continue well into next year,” the World Bank said.\n\nThe warnings come ahead of crucial policy votes at the Fed and Bank of England next week. The US central bank is expected to raise rates by 75 basis points for the third meeting in a row on Thursday, while UK borrowing costs are likely to rise by 50 basis points.\n\nThe expected rises in global interest rates would bear down on inflation, but not enough to meet central banks’ targets, which are usually around 2 per cent, the World Bank warned. Core global inflation, excluding energy, was still likely to be running at a rate of 5 per cent next year — twice the pre-pandemic rate.\n\nIf such a level of inflation persuaded central banks to become even more aggressive, global economic growth would drop to 0.5 per cent in 2023, according to the World Bank.\n\nThat would meet most definitions of a global recession just three years after the last one, the World Bank added, because with population growth, average global incomes would be falling.\n\nIn its modelling(opens a new window), the bank said there needed to be some tightening of monetary policy, but this should be accompanied by every effort to ease bottlenecks both internationally and domestically to allow production to increase without stoking inflation.\n\nThis includes boosting the supply of commodities, food and energy to alleviate much of the global inflationary forces, alongside investing to decarbonise economic growth.\n\nThe bank’s findings have been echoed by former IMF chief economist Maurice Obstfeld, now a senior fellow at the Peterson Institute for International Economics.\n\n“Just as central banks, especially those of the richer countries, misread the factors driving inflation when it was rising in 2021, they may also be underestimating the speed with which inflation could fall as their economies slow,” said Obstfeld, urging them to be less “zealous” in raising interest rates.\n\n“By simultaneously all going in the same direction, they risk reinforcing each other’s policy impacts without taking that feedback loop into account,” he added.\n\nVia: [https://www.ft.com/content/d95de774-e4e4-4864-a5fd-a0f696ee6728](https://www.ft.com/content/d95de774-e4e4-4864-a5fd-a0f696ee6728) (non-paywall at: [https://archive.ph/jbzv0](https://archive.ph/jbzv0))",
                "date posted": "2022-09-15",
                "upvotes": 988,
                "replies": {
                    "0": {
                        "upvotes": 691,
                        "text": "Devastating downturn or devastating inflation....take your pick."
                    },
                    "1": {
                        "upvotes": 278,
                        "text": "News flash - junkie goes into withdrawal without more smack."
                    },
                    "2": {
                        "upvotes": 309,
                        "text": "To imply that raising rates to a normal level is the issue and not the near 12 year supply of free money is.. disingenuous to say the least."
                    },
                    "3": {
                        "upvotes": 9,
                        "text": "World Bank sounds like WHO during the early pandemic stage."
                    },
                    "4": {
                        "upvotes": 144,
                        "text": "Am I a stupid moron to think that the only way to decrease inflation is to increase interest rates to deliberately cause a recession? How could you slow inflation without decreasing the supply of money?"
                    },
                    "5": {
                        "upvotes": 85,
                        "text": "The US: \"Nah...\""
                    }
                }
            }
        ]
    },
    "25": {
        "date_range": [
            "2022-09-17",
            "2022-09-24"
        ],
        "posts": [
            {
                "title": "British pound plunges below $1.11 after new government announces tax cuts and 10% inflation",
                "text": "Full article from CNBC [here](https://www.cnbc.com/2022/09/23/british-pound-plunges-to-fresh-37-year-low-of-1point10-.html)\n\nSterling dipped as low as $1.1032 at 12:00 p.m. London time, around an hour after the measures were unveiled in the House of Commons.\n\nThe pound has been on a precipitous fall against the greenback this year, hitting levels this month not seen since 1985.\n\nFriday’s measures were billed by the government as heralding a new era for the U.K. focused on growth, and included a mix of tax cuts and investment incentives for businesses.\n\n\nCuts include reduced taxes on property purchases effective immediately, a reversal of the 1.25% National Insurance hike, and a 1% decrease in basic income tax. The highest level of income tax effective at £150k or more (45%) is now completely scrapped. \n\nSo what's the play here for UK investors? Just dump into US equities? I recently rejigged my pension around to accommodate for a declining UK market and seems like that might have been the right move. I'm now about 60% in US and 10% UK, 30% rest of the world.",
                "date posted": "2022-09-23",
                "upvotes": 2299,
                "replies": {
                    "0": {
                        "upvotes": 459,
                        "text": "Maybe they got their advice on fighting inflation from this upcoming unconventional economist named Erdogan."
                    },
                    "1": {
                        "upvotes": 629,
                        "text": "Now a pint only cost 10$ instead of 15$"
                    },
                    "2": {
                        "upvotes": 276,
                        "text": "Genius. Pure genius"
                    },
                    "3": {
                        "upvotes": 88,
                        "text": "As a US investor, I think it’s attractive at this point to buy some of the euro and pound denominated equities without actually buying pounds and euros, so I end up short those currencies against the dollar and long the equity itself. \n\nI personally think the luxury fashion houses are the European blue chips (this instead of the US version which is more tech), so I’ve been buying them up. The short currency position has canceled out a lot of the drop on the equities, while I wait for things to turn more positive."
                    },
                    "4": {
                        "upvotes": 349,
                        "text": "The UK is in trouble. It has seen growth stagnate in the past 10 years, and the brexit and Russia conflict has placed its economy into a bad situation. Truss wants to cut taxes but also give subsidies to poorer folks which just increases an already high debt load. As for investing it’s probably better to just invest in the US market at this point. The DJ and NASDAQ has better returns and the rules are more attractive for founders/companies. The rules in the UK aren’t as welcoming for new tech and you can see it with who makes up the FTSE"
                    },
                    "5": {
                        "upvotes": 70,
                        "text": "Thoughts on how a UK investor can look after the cash they keep in pounds in their ISA without having to buy equities? Hold foreign currency? Short dated US treasuries? Money market funds?"
                    }
                }
            },
            {
                "title": "Fed now forecasts hiking rates as high as 4.6%. That will hurt market alot harder.",
                "text": "[https://www.cnbc.com/2022/09/21/the-fed-forecasts-hiking-rates-as-high-as-4point6percent-before-ending-inflation-fight.html](https://www.cnbc.com/2022/09/21/the-fed-forecasts-hiking-rates-as-high-as-4point6percent-before-ending-inflation-fight.html)\n\nSo the Fed now wants to hike to 4.6% and keep it there through 2023!\n\nThat's a lot higher than the 4% expected and will certainly affect the economy a lot harder not just in the short term but also next year and beyond.\n\nBorrowing rates for consumers and companies will go up much higher and stay high which obviously will hurt spending therefore slowing down growth.\n\nHigher rates means for most companies it becomes a lot more difficult to borrow money to finance further growth hence companies are preparing for the slowdown and scaling back.\n\nAlso the variable rate debt lots of companies have accumulated over the past years of easy money will really start to hurt now as this type of debt is linked to rates.\n\nIt's important to understand this is not just a short term effect. Rate hikes have impact on companies many quarters after they take affect. Most talking heads in the media but also permabulls here on reddit seem to ignore that and just keep talking up the markets so beware. A short term rebound does not mean it can't go lower afterwards!\n\nWould not be surprised to see another short bear market pump before it goes much lower again once companies start revising their earnings forecast to the downside.\n\nPowell trying to talk up the markets afterwards clearly doesn't help anymore. He should stick to what FOMC members have decided instead of trying to give it a \"rosy\" spin.\n\nFinal point, so we now have a problem in the housing market, credit market (too much borrowing going on) and in the equity markets (earnings compression coming). Not sure how that combo will end but don't have a good feeling about this. Hope this won't be 2008 all over again or worse.\n\nThat's in a nutshell what the Fed decided today and its future impact on the markets. Stay careful and don't be a mindless sheep.",
                "date posted": "2022-09-21",
                "upvotes": 1378,
                "replies": {
                    "0": {
                        "upvotes": 715,
                        "text": "4.6% means mortgages will be 7%"
                    },
                    "1": {
                        "upvotes": 385,
                        "text": "It looks like the market did not price this in. However, I think it is good that today we have more clarity going into the rest of the year, and the next few years."
                    },
                    "2": {
                        "upvotes": 68,
                        "text": "All this cash waiting around for huge rates on treasuries."
                    },
                    "3": {
                        "upvotes": 621,
                        "text": "remember when people here said the fed couldn't raise rates because of the debt\n\npepperidge farm remembers"
                    },
                    "4": {
                        "upvotes": 214,
                        "text": "What most people aren’t thinking about is how this impacts rest of the world.\n\n\nDollar will get stronger and it will make it harder for many third world countries to service their dollar debts with plummeting exchange rates. This is what happened with Sri Lanka, Argentina, turkey and Pakistan this year. Many many countries will join that list and this may push many countries over the edge."
                    },
                    "5": {
                        "upvotes": 74,
                        "text": "I think coming months will be great long term investment opportunities for dollar cost average investors"
                    }
                }
            }
        ]
    }
}